Repository: eboladev/Bulmages-1
Catalog: bulmages/bulmafact/plugins/pluginbf_cuadrante/po/pluginbf_cuadrante_*.po
Languages: fr_fr

source: &Aceptar
fr_fr: &Accepter

source: &Cancelar
fr_fr: &Annuler

source: &Herramientas
fr_fr: &Outils

source: Actualizar
fr_fr: Actualiser

source: Almacen
fr_fr: Magasin

source: Apartura tarde
fr_fr: Ouverture de soirée

source: Apertura Manyana
fr_fr: Ouverture de matinée

source: Apertura Tarde
fr_fr: Ouverture de soirée

source: Apertura manyana
fr_fr: Ouverture de matinée

source: Borrar almacen
fr_fr: Effacer le Magasin

source: Cierre Manyana
fr_fr: Fermeture de matinée

source: Cierre Tarde
fr_fr: Fermeture de soirée

source: Cierre manyana
fr_fr: Fermeture de matinée

source: Cierre tarde
fr_fr: Fermeture de soirée

source: Comentarios
fr_fr: Libellés

source: Cuadrante
fr_fr: Horaire

source: Cuadrante y Uso Horario
fr_fr: Planing et utilisation horaire

source: Domingo
fr_fr: Dimanche

source: Editar
fr_fr: Editer

source: Error al crear el almacen
fr_fr: Erreur en création du magasin

source: Error al iniciar el cuadrante
fr_fr: Erreur de démarrage de l'horaire

source: Fecha
fr_fr: Date

source: Fecha final ausencia
fr_fr: Date d'absence finale

source: Fecha inicial ausencia
fr_fr: Date initiale d'absence

source: Festivo
fr_fr: Fériés

source: Fiesta general
fr_fr: Fête générale

source: Generando Informe
fr_fr: Générer un rapport

source: Guardar almacen
fr_fr: Sauvegarder le Magasin

source: Hora
fr_fr: Heure

source: Hora Fin
fr_fr: Heure de fin

source: Hora Inicio
fr_fr: Heure de début

source: Horario
fr_fr: Planing Horaire

source: ID Cuadrante
fr_fr: ID horaire

source: ID ausencia
fr_fr: ID d'absence

source: ID cuadrante
fr_fr: ID horaire

source: ID horario
fr_fr: ID Horaire

source: ID trabajador
fr_fr: ID Salarié

source: Igual que la Semana Anterior
fr_fr: Egale à la semaine précédente

source: Imprimir
fr_fr: Imprimer

source: Jueves
fr_fr: Jeudi

source: Limpiar Cuadrante
fr_fr: Nettoyer l'horaire

source: Lunes
fr_fr: Lundi

source: Martes
fr_fr: Mardi

source: Miercoles
fr_fr: Mercredi

source: Motivo
fr_fr: Motiver

source: Nombre Trabajador
fr_fr: Nom du Salarié

source: Ocultar Panel
fr_fr: Cacher le panneau

source: Sabado
fr_fr: Samedi

source: Validaciones
fr_fr: Validation

source: Viernes
fr_fr: Vendredi
