Repository: eboladev/Bulmages-1
Catalog: bulmages/bulmafact/plugins/pluginbf_asiento/po/pluginbf_asiento_*.po
Languages: fr_fr

source: &Aceptar
fr_fr: &Accepter

source: &Asiento
fr_fr: &Ecriture

source: &Asiento contable
fr_fr: &Ecriture

source: &Cancelar
fr_fr: &Annuler

source: &Concepto:
fr_fr: &Concept :

source: &Ejercicio:
fr_fr: &Exercice :

source: &Espaciar asientos contables
fr_fr: &Espacer les écritures

source: &Fecha del asiento:
fr_fr: &Date de l'écriture :

source: &Lista de asientos contables
fr_fr: &Liste des écritures

source: &Mostrar:
fr_fr: &Afficher :

source: &No
fr_fr: &Non

source: &Partida igual a:
fr_fr: &Partie égale à :

source: &Plantilla:
fr_fr: &Personnel :

source: &Reordenar asientos contables
fr_fr: &Réordonner les écritures

source: &Si
fr_fr: &Oui

source: (todos)
fr_fr: (tous)

source: Abrir asiento
fr_fr: Ouvrir l'écriture

source: Actualizar
fr_fr: Actualiser

source: Apertura
fr_fr: Ouverture

source: Aplicar asiento inteligente
fr_fr: Aide à la saisie

source: Apuntes
fr_fr: Notes

source: Asiento
fr_fr: Ecriture

source: Asiento contable
fr_fr: Ecriture

source: Asiento de &cierre
fr_fr: Ecriture de &fermeture

source: Asiento de &regularizacion
fr_fr: Ecriture de &régularisation

source: Asiento de a&pertura
fr_fr: Ecriture d'&ouverture

source: Asiento de apertura
fr_fr: Ecriture d'ouverture

source: Asiento de cierre
fr_fr: Ecriture de fermeture

source: Asiento de regularizacion
fr_fr: Ecriture de régulation

source: Asiento inexistente.
fr_fr: Ecriture inexistante.

source: Asientos
fr_fr: Ecritures

source: Asientos abiertos
fr_fr: Ecritures ouvertes

source: Asientos cerrados
fr_fr: Ecritures fermées

source: Asientos inteligentes
fr_fr: Aide à la saisie

source: Borrador
fr_fr: Brouillon

source: Borrar asiento
fr_fr: Fermer l'écriture

source: Centro de coste
fr_fr: Centre de finance

source: Cerrar asiento
fr_fr: Fermer l'écriture

source: Cierre
fr_fr: Fermer

source: Clase
fr_fr: Classe

source: Codigo
fr_fr: Code

source: Comentario
fr_fr: Libellé

source: Comentarios
fr_fr: Libellés

source: Comentarios del asiento
fr_fr: Libellés

source: Concepto contable
fr_fr: Raison

source: Conciliacion
fr_fr: Conciliation

source: Configurar
fr_fr: Configurer

source: Contrapartida
fr_fr: Contrepartie

source: Cuenta de Regularizacion incorrecta. Revise la configuracion
fr_fr: Ecriture de régulation incorrecte. Revoir la configuration

source: Cuenta:
fr_fr: Compte :

source: Datos del asiento:
fr_fr: Date de l'écriture :

source: Debe
fr_fr: Débit

source: Debe (borrador):
fr_fr: Débit (brouillon) :

source: Debe borrador
fr_fr: Débit brouillon

source: Debe:
fr_fr: Débit :

source: Descripcion del apunte
fr_fr: Description

source: Descripcion del asiento
fr_fr: Libellé

source: Descuadre:
fr_fr: Précision :

source: Desea crear un nuevo asiento en esa posicion?
fr_fr: Voulez vous créer une nouvelle écriture ici ?

source: El asiento se ha guardado correctamente.
fr_fr: Ecriture sauvegardée correctement.

source: Error al crear el asiento
fr_fr: Erreur de création d'écriture

source: Error en el guardardo
fr_fr: Erreur de sauvegarde

source: Exportar asiento
fr_fr: Exporter l'écriture

source: Extender asiento
fr_fr: Arborer l'écriture

source: Fecha
fr_fr: Date

source: Fecha &final:
fr_fr: Date &finale :

source: Fecha &inicial:
fr_fr: Date &initiale :

source: Fecha Factura
fr_fr: Date de facture

source: Fecha del asiento
fr_fr: Date de l'écriture

source: Fecha final
fr_fr: Date finale

source: Fecha final ejercicio:
fr_fr: Date finale de l'exercice :

source: Fecha final regularizacion:
fr_fr: Date finale de régulation :

source: Fecha inicial
fr_fr: Date initiale

source: Fecha inicial ejercicio:
fr_fr: Date initiale de l'exercice :

source: Fecha inicial regularizacion:
fr_fr: Date finale de régulation :

source: Fecha:
fr_fr: Date :

source: Filtrar
fr_fr: Filtrer

source: Guardar asiento
fr_fr: Sauvegarder l'écriture

source: Haber
fr_fr: Crédit

source: Haber (borrador):
fr_fr: Crédit (Brouillon) :

source: Haber borrador
fr_fr: Crédit Brouillon

source: Haber:
fr_fr: Crédit :

source: Id apunte
fr_fr: ID NOTE

source: Id asiento
fr_fr: ID de l'écriture

source: Id borrador
fr_fr: ID Brouillon

source: Id centro de coste
fr_fr: ID Centre de finance

source: Id cuenta
fr_fr: ID Compte

source: Id tipo de IVA
fr_fr: ID Type de TVA

source: Id. Registro IVA
fr_fr: ID registre de TVA

source: Importar asiento
fr_fr: Importer l'écriture

source: Imprimir
fr_fr: Imprimer

source: La fecha inicial es posterior a la fecha final.
fr_fr: Date initiale postérieure à la date finale.

source: Listado de asientos
fr_fr: Liste des écritures

source: Mostrar asiento
fr_fr: Afficher l'écriture

source: Mostrar extracto (ano)
fr_fr: Afficher l'extrait (an)

source: Mostrar extracto (dia)
fr_fr: Afficher l'extrait (jour)

source: Mostrar extracto (mes)
fr_fr: Afficher l'extrait (mois)

source: No existe ningun asiento para mostrar
fr_fr: Il n'y a aucune écriture à afficher

source: Nombre de la cuenta
fr_fr: Compte

source: Nuevo asiento
fr_fr: Nouvelle écriture

source: Num. Factura
fr_fr: Numéro de facture

source: Orden
fr_fr: Ordre

source: Orden de asiento
fr_fr: Ordre de l'écriture

source: Orden del asiento:
fr_fr: Ordre de l'écriture :

source: Ordena los asientos
fr_fr: Trier les écritures

source: Ordena los asientos dejando espacios entre ellos
fr_fr: Trier les écritures en laissant des espaces entre elles

source: Permite ver el listado de asientos
fr_fr: Permettre de voir la liste des écritures

source: Permite ver y modificar asientos
fr_fr: Permettre de voir et modifier les écritures

source: Podra disponer de la informacion del asiento
fr_fr: Disponibilité de l'information de l'écriture

source: Regularizacion
fr_fr: Régularisation

source: Return
fr_fr: Retour

source: Saldo:
fr_fr: Solde :

source: Se han espaciado los asientos
fr_fr: Ecritures espacées

source: Se han ordenado los asientos
fr_fr: Ecritures triées

source: Se va a borrar el asiento. ¿Esta seguro?
fr_fr: Effacer l'écriture, êtes vous sûr ?

source: Tipo de asiento
fr_fr: Type d'écriture

source: Tipo de cuenta
fr_fr: Type de compte

source: Todos los asientos
fr_fr: Toutes les écritures

source: Total Debe:
fr_fr: Débit total :

source: Total Haber:
fr_fr: Crédit total :

source: y ( >=
fr_fr: et ( >=

source: y <=
fr_fr: et <=
