<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head>

<title>El Consejo de la UE No Debe Adoptar el Texto Ileg&iacute;timo sobre las Patentes de Software</title><meta http-equiv="Content-Type" content="text/html; charset=iso8859-1"><meta http-equiv="Refresh" content="300, http://www.iglues.org/home.php" /></head>

<body alink="#ff9900" bgcolor="#000000" link="#ff9900" text="#ffffff" vlink="#ff9900">
<center>

<table bgcolor="#31454a" border="1" cellpadding="0" cellspacing="0" width="80%">
<tbody><tr>
<td align="center" height="45" valign="top" width="100%">
<table bgcolor="#31454a" border="0" cellpadding="40" cellspacing="0" width="100%">
<tbody><tr>
<td colspan="2" align="center" valign="middle"><font color="red" size="4"><b><br>

<big>S T O P</big><br>

<br>
Miembros del Consejo de Ministros de Agricultura y Pesca de la UE, por favor, lean lo siguiente:<br>
</b></font></td>
</tr>

<tr>
<td>
<hr>
<h1>Asunto: Directiva de Patentes de Programas en la lista de Puntos A del Consejo Agr&iacute;cola</h1>
</td>
<td align="right" valign="middle">
<img src="http://www.iglues.org/img/noepatents_liberty120.png" alt="Imagen Patentes NO"><br>
</td>

</tr>

<tr>
<td colspan="2">

<p>Estimado Ministro de Agricultura y Pesca de la UE:
</p>
<p>
En la reuni&oacute;n del Consejo Agr&iacute;cola del martes y mi&eacute;rcoles pr&oacute;ximos, es probable 
que se incluya en el &uacute;ltimo momento la Directiva COM 2002/0047 
(COD) "Sobre la Patentabilidad de las Invenciones Implementadas en Ordenador" 
(Directiva sobre Patentes de Programas Inform&aacute;ticos) en la lista de Puntos 
A (<i>A-Items</i>).
</p>
<p>Dicha lista no debe ser aprobada.</p>
<p>Intervengan cuando el Presidente del Consejo pregunte por la
aceptaci&oacute;n de los Puntos A (justo al principio), y exijan la retirada
de la aceptaci&oacute;n del texto del Consejo sobre la directiva COM 2002/0047
de la lista de Puntos A.</p>
<p>Las reglas del procedimiento del Consejo exigen que la agenda provisional 
sea enviada con 14 d&iacute;as de antelaci&oacute;n. En este caso, la directiva de 
patentes de programaci&oacute;n se introdujo en la agenda con no m&aacute;s de 2 d&iacute;as 
laborables de antelaci&oacute;n.</p>

<p>En conformidad con el art&iacute;culo 3, puntos 7-8, de las Reglas de 
Procedimiento del Consejo, es suficiente si un pa&iacute;s se opone a esta moci&oacute;n de &uacute;ltima hora, si bien se espera que el apoyo a la retirada proceda de varios 
pa&iacute;ses.</p>
<p>El texto propuesto no goza de una mayor&iacute;a cualificada. Se ha incluido
en la agenda sobre la base de interpretaciones cuestionables, cuando no 
violaciones, de las Reglas del Procedimiento del Consejo.</p>
<ol>
<li>El Gobierno holand&eacute;s se ha visto obligado a retirar su apoyo 
por parte de su parlamento. No se puede adoptar una moci&oacute;n sin una 
votaci&oacute;n y, si se vota, la presidencia holandesa deber&aacute; abstenerse. Si 
la presidencia holandesa no se abstiene, el ministro Brinkhorst podr&iacute;a 
enfrentarse a una moci&oacute;n de censura y ser cesado. Esto significa que, 
dada la oposici&oacute;n continuada de Espa&ntilde;a, Italia, B&eacute;lgica y Austria, e 
incluso sin contar con la abstenci&oacute;n de Polonia, la actual Propuesta 
del Consejo ya no goza del respaldo de una mayor&iacute;a cualificada.</li>
<li>El 19 de mayo, y nuevamente el 16 de noviembre, el gobierno de 
Polonia ha confirmado que no apoya la propuesta del Consejo. No 
obstante el ministro polaco de la UE, que no est&aacute; a cargo del 
expediente, bajo presi&oacute;n de la presidencia del Consejo, ha sido hasta 
ahora reticente a ejecutar las decisiones del Gobierno polaco.</li>
<li>La propuesta del Consejo ha sido criticada como deficiente por 
todos los grupos del Parlamento Federal alem&aacute;n (Bundestag). Como 
se&ntilde;ala la resoluci&oacute;n inter-grupo del 30 de noviembre de 2004, no 
satisface las exigencias de claridad y ecuanimidad que debe satisfacer 
una propuesta de tal importancia.</li>
<li>El Gobierno let&oacute;n ha dejado claro en una declaraci&oacute;n unilateral 
que no apoya el texto propuesto. Los gobiernos franc&eacute;s y h&uacute;ngaro 
tambi&eacute;n han expresado reservas. En Eslovenia, Eslovaquia, Portugal y 
Hungr&iacute;a no hay pr&aacute;cticamente ning&uacute;n apoyo para las patentes de 
programaci&oacute;n en la industria o el gobierno, excepto en los reducidos 
c&iacute;rculos que dominan el grupo de trabajo sobre patentes del Consejo.</li>
<li>La nueva votaci&oacute;n es necesaria porque las Normas de 
Procedimiento del Consejo exigen una mayor&iacute;a cualificada a la hora de 
la adopci&oacute;n formal de una Posici&oacute;n Com&uacute;n. Un acuerdo pol&iacute;tico solo 
puede ser adoptado si es apoyado por una mayor&iacute;a cualificada de 
gobiernos en el momento de la votaci&oacute;n. La 
<a href="http://k.lenz.name/LB/">"adopci&oacute;n como lista de 
Puntos A" (A-Items) significa la "adopci&oacute;n sin discusi&oacute;n", no "sin 
voto". No puede haber adopci&oacute;n sin voto</a>.</li>

<li>El cambio en la ponderaci&oacute;n de los votos del consejo del 1 de 
noviembre significa que la oferta del consejo ahora carece de mayor&iacute;a 
cualificada si se abstienen los Pa&iacute;ses Bajos o Polonia.</li>
<li>Los documentos explicativos del borrador del Consejo fueron 
accesibles s&oacute;lo recientemente, de forma que a fecha de esta reuni&oacute;n 
del Consejo s&oacute;lo habr&aacute; pasado la mitad del periodo de seis semanas, 
reservado para la consulta de las instituciones nacionales. La 
apresurada convocatoria de una sesi&oacute;n extraordinaria del parlamento 
holand&eacute;s tras la reuni&oacute;n del COREPER (el Comit&eacute; de Representantes Permanentes) 
el pasado 15 de diciembre 
demuestra la importancia de este periodo consultivo. El texto del 
Consejo rechaza enmiendas esenciales del Parlamento Europeo, 
argumentando que son "incompatibles con el tratado TRIPs" o que no 
reflejan "pr&aacute;cticas arraigadas". Estos argumentos son nuevos, no 
contemplados en ning&uacute;n "acuerdo pol&iacute;tico" y en clara contradicci&oacute;n con 
la resoluci&oacute;n del Parlamento alem&aacute;n, y no se pueden adoptar sin una 
votaci&oacute;n.</li>
<li>El Protocolo sobre el Papel de los Parlamentos Nacionales en el 
Tratado de Amsterdam anima expl&iacute;citamente a la participaci&oacute;n de los 
parlamentos nacionales en el proceso legislativo de la UE. No exime al 
Consejo de Ministros. Por consiguiente, las tentativas de frustrar la 
integraci&oacute;n en esta etapa de las posiciones de los diversos 
parlamentos nacionales (Pa&iacute;ses Bajos y Alemania) ser&iacute;an ileg&iacute;timas.</li>
</ol>
<p>La directiva de patentes de software est&aacute; creando grandes dificultades 
para el consejo porque el Consejo ha estado dejando a los zorros a 
cargo del gallinero. El "Grupo de Trabajo sobre Propiedad Intelectual" 
(e industrial, dado que se trata de patentes) est&aacute; formado por los 
mismos funcionarios nacionales de patentes que integran tambi&eacute;n 
personalmente la Oficina Europea de Patentes. Se han negado a tratar 
los temas propuestos de forma constructiva. Han ignorado las enmiendas 
sustanciales del Parlamento Europeo sin justificaci&oacute;n y sin hacer caso 
  a los problemas de pol&iacute;tica econ&oacute;mica que el Parlamento intent&oacute; 
  encarar. De hecho, simplemente han vuelto a formular su acuerdo previo 
  de noviembre de 2002, en el que recitaban las doctrinas recientes de 
  la Oficina Europea de Patentes. Estas doctrinas autorizan de facto el 
  monopolio de los m&eacute;todos de negocio, algoritmos, estructuras de datos 
  y descripciones de procesos del mismo modo que en los EEUU, sin 
  ninguna limitaci&oacute;n efectiva. La brecha entre estas doctrinas y la 
  propuesta del Parlamento es tan amplia que es imposible franquearla 
  sin el procedimiento de una segunda lectura. El Consejo a&uacute;n no ha 
  comenzado una primera lectura real, ni tampoco ha entregado un texto 
  que muestre una voluntad de enfrentarse a las cuestiones. Ahora 
  tenemos la oportunidad de dar ese primer paso. Si no se da en la 
  primera lectura del Consejo, es poco probable que la directiva vaya a 
  ninguna parte en los siguientes pasos del procedimiento de co-decisi&oacute;n.
 <p>
En resumen: 
<ul>
<li>La actual propuesta del Consejo no se puede aprobar en la Lista 
de Puntos A y no hay necesidad de aceptarla por parte de ning&uacute;n 
ministro del Consejo Agr&iacute;cola.</li>
<li>Cualquier intento de aprobar la propuesta tal y como est&aacute; 
redactada es muy peligrosa para la sociedad de la informaci&oacute;n y para 
la democracia en la UE e incompatible con las Normas de Procedimiento 
del Consejo de la UE.</li>
</ul>
</p>

<p>
Sinceramente suyo.
</p>

<hr>

<br>
<p>Hay m&aacute;s informaci&oacute;n sobre el tema en:
</p><ul>
<li><a href="http://proinnova.hispalinux.es/">Proinnova</a> [ES]
</li><li><a href="http://demo.ffii.org/">Acciones en la Red</a>
</li><li><a href="http://swpat.ffii.org/letter/cons0406/index.es.html">Petici&oacute;n Urgente</a> [ES]

</li><li><a href="http://kwiki.ffii.org/ConsRevers04En">Revirtamos la Decisi&oacute;n del Consejo del 18 de mayo</a>
</li>
<li><a href="http://kwiki.ffii.org/SwpatcninoEs">Noticias FFII sobre Patentes de Programaci&oacute;n</a> [ES]</li>
<li><a href="http://swpat.ffii.org/">FFII: Patentes de Programas en Europa</a>
<li><a href="http://www.nosoftwarepatents.com/es/m/intro/index.html">NoSoftwarePatents.com</a> [ES]</li>
</ul>

<p>Si usted no es Ministro de Agricultura y Pesca, por favor contin&uacute;e
<a href="http://www.iglues.org/home.php">aqu&iacute;</a>.</p>

<br />
<p align="center">
<a href="http://www.iglues.org/home.php"><img src="http://www.iglues.org/img/iglues.png" 
alt="Logo de IGLUES"></a>
</p>
</td>
</tr>
</tbody></table>
</td></tr></tbody></table>
</center>
</body></html>
