Repository: eboladev/Bulmages-1
Catalog: bulmages/bulmafact/plugins/pluginbf_corrector/po/pluginbf_corrector_*.po
Languages: fr_fr

source: Apunte con Cuenta
fr_fr: Libellé de compte

source: Apunte con Descripcion
fr_fr: Libellé

source: Apunte con Saldo
fr_fr: Libellé de solde

source: Cerrar
fr_fr: Fermer

source: Comprobacion por asientos
fr_fr: Vérification des écritures

source: Condicion:
fr_fr: Condition :

source: Configurar
fr_fr: Configurer

source: Corrector
fr_fr: Correcteur

source: Corrector. Muestra/oculta el corrector
fr_fr: Correcteur. Montrer/Occulter le correcteur

source: Corregir
fr_fr: Corriger

source: Deben existir registros que cumplan esta condicion en el periodo
fr_fr: Il doit exister des registres qui remplissent cette condition dans cette période

source: Periodicidad
fr_fr: Périodicité

source: Regla:
fr_fr: Règle :

source: Reglas de Corrector
fr_fr: Règle du correcteur

source: Reglas sobre Apuntes
fr_fr: Règle sur les notes

source: igual
fr_fr: Egal

source: mayor
fr_fr: plus grand

source: menor
fr_fr: plus petit
