Repository: eboladev/Bulmages-1
Catalog: bulmages/bulmafact/src/po/bulmafact_*.po
Languages: ca_es

source: % Descuento
ca_es: % Descompte

source: &Aceptar
ca_es: &Accepta

source: &Acerca de
ca_es: &Quant a

source: &Acerca de Iglues/BulmaFact
ca_es: &Quant a Iglues/BulmaFact

source: &Cancelar
ca_es: &Cancel·la

source: &Cerrar
ca_es: Tan&ca

source: &Documentacion
ca_es: &Documentació

source: &Propiedades de la empresa...
ca_es: &Dades bàsiques de l'entitat...

source: &Salir del programa
ca_es: &Surt del programa

source: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:9pt; font-weight:600; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Facturacion GPL - Version 0.13.0 -</p></body></html>
ca_es: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:9pt; font-weight:600; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Facturació GPL - Versió 0.13.0 -</p></body></html>

source: A&utores
ca_es: A&utors

source: A&yuda
ca_es: A&juda

source: Abre todos los documentos con esta referencia
ca_es: Obre tots els documents amb aquesta referència

source: Acerca de Iglues/BulmaFact
ca_es: Quant a Iglues/BulmaFact

source: Acuerdo de &licencia
ca_es: Acord de &llicència

source: Articulo
ca_es: Article

source: Articulo:
ca_es: Article:

source: Avanzados
ca_es: Avançats

source: Cantidad
ca_es: Quantitat

source: Cargando plugins
ca_es: Carregant plugins

source: Cobrado
ca_es: Cobrat

source: Codigo completo articulo
ca_es: Codi complet article

source: Codigo serie factura
ca_es: Codi sèrie factura

source: Compilado usando la version de QT:
ca_es: Compilat fent servir la versió de QT:

source: Configuracion
ca_es: Arranjament

source: Configuracion avanzada
ca_es: Configuració avançada

source: Configuracion basica
ca_es: Configuració bàsica

source: Descripcion
ca_es: Descripció

source: Descripcion serie factura
ca_es: Descripció sèrie factura

source: Descuento
ca_es: Descompte

source: Direccion
ca_es: Adreça:

source: El codigo del articulo no existe. ATENCION: No se guadara bien el documento hasta que sea valido.
ca_es: El codi de l'article no existeix. ATENCIÓ: No es desarà bé el document fins que no sigui vàlid.

source: Entregado
ca_es: Entregat

source: Error al establecer el almacen.
ca_es: Error en establir el magatzem.

source: Error inesperado en BulmaFact. El programa se cerrara.
ca_es: Error inesperat en BulmaFact. El programa se tancarà.

source: Error inesperado en la impresion
ca_es: Error inesperat en la impressió

source: Este item es un articulo encontrado, no entrado por el usuario.
ca_es: Aquest ítem és un article trobat, no entrat per l'usuari.

source: Facturacion GPL
ca_es: Facturació GPL

source: Facturado
ca_es: Facturat

source: Familia:
ca_es: Família:

source: Fichas
ca_es: Fitxes

source: Id albaran
ca_es: Id albarà

source: Id articulo
ca_es: Id article

source: Idioma:
ca_es: Llengua:

source: Idiomas y traducciones:
ca_es: Llengües i traduccions:

source: Iglues/BulmaFact - Facturacion GPL
ca_es: Iglues/BulmaFact - Facturació GPL

source: Informacion del &sistema
ca_es: Informació del &sistema

source: Informe por referencia
ca_es: Informe per referència

source: Inicializando componentes
ca_es: Inicialitzant components

source: Iniciando clases
ca_es: Inicialitzant classes

source: Item: '%1', num: '%2', itemText: '%3', itemData: '%4'.
ca_es: Ítem: '%1', núm: '%2', itemText: '%3', itemData: '%4'.

source: Lanzando plugins
ca_es: Llençant plugins

source: Leyendo configuracion
ca_es: Llegint configuració

source: Listados
ca_es: Llistats

source: Maest&ro
ca_es: Mest&re

source: Modo Experto
ca_es: Mode Expert

source: Municipio
ca_es: Municipi

source: Nombre
ca_es: Nom

source: Nombre articulo
ca_es: Nom article

source: Numero de linea
ca_es: Número de línia

source: Orden
ca_es: Ordre

source: Ordenar &ventanas
ca_es: Ordena &finestres

source: Organizacio&n en cascada
ca_es: Organització en cascada

source: Pagado
ca_es: Pagat

source: Pais
ca_es: País

source: Paises / Provincias
ca_es: Països/Províncies

source: Paises y provincias
ca_es: Països i províncies

source: Pedido
ca_es: Comanda

source: Porcentaje
ca_es: Percentatge

source: Precio
ca_es: Preu

source: Propiedades de la empresa
ca_es: Dades bàsiques de l'entitat

source: Referencia
ca_es: Referència

source: Se perderan los cambios no guardados
ca_es: Es perdran els canvis no desats

source: Seguro que desea abandonar el programa
ca_es: Segur que desitgeu abandonar el programa

source: Serie de Factura
ca_es: Sèrie de factura

source: Series de factura
ca_es: Sèries de factura

source: Sopor&te
ca_es: Supor&t

source: Telefono
ca_es: Telèfon

source: Terminado
ca_es: Terminat

source: Tiene que guardar el documento antes de poder procesarlo.
ca_es: Heu de desar el document abans de poder procesar-lo

source: Tipo Articulo:
ca_es: Tipus Article

source: Total Linea
ca_es: Total Línia

source: Ultimo item: '%1', num: '%2', itemText: '%3', itemData: '%4'.
ca_es: Últim ítem: '%1', núm: '%2', itemText: '%3', itemData: '%4'.

source: Venta&na
ca_es: Fi&nestra

source: Ventana &completa
ca_es: Finestra &Completa
