<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Manual de BulmaGes</title>
<meta http-equiv="Content-Type"
 content="text/html; charset=iso-8859-1">
<style type="text/css">
<!--
a {
	font-family: Verdana, Arial, Helvetica, sans-serif;
	font-size: 9px;
	color: #000000;
	text-decoration: none;
}

a:hover {
	font-family: Verdana, Arial, Helvetica, sans-serif;
	font-size: 9px;
	color: #663333;
	text-decoration: none;
}
.head1 {
	font-family: Geneva, Arial, Helvetica, san-serif;
	font-size: 16px;
	font-weight: bold;
	text-transform: capitalize;
	color: #000066;
	filter: Xray;
}

-->
  </style>
<style type="text/css">
<!--
.titular {
	font-family: Verdana, Arial, Helvetica, sans-serif;
	font-size: 24px;
	font-style: normal;
	font-weight: bold;
	font-variant: small-caps;
	text-transform: uppercase;
	color: #0000FF;
	text-decoration: none;
}
-->
</style>
<style type="text/css">
<!--
.subtitular1 {
	font-family: Arial, Helvetica, sans-serif;
	font-size: 16px;
	font-style: normal;
	line-height: normal;
	font-weight: bold;
	font-variant: normal;
	text-transform: uppercase;
	color: #FF0000;
	text-decoration: none;
}
.subtitular2 {
	font-family: Arial, Helvetica, sans-serif;
	font-size: 16px;
	font-style: normal;
	font-weight: bold;
	font-variant: small-caps;
	text-transform: capitalize;
	color: #CC3399;
	text-decoration: none;
}
body {
	font-family: Arial, Helvetica, sans-serif;
	font-size: small;
	font-style: normal;
	color: #663300;
	text-decoration: none;
}
.codigo {
	font-family: "Courier New", Courier, mono;
	font-size: 12px;
	font-weight: bold;
	font-variant: normal;
	text-transform: lowercase;
	color: #006600;
	text-decoration: none;
	background-color: #CCCCCC;
	margin: 3px;
	padding: 3px;
	height: auto;
	width: auto;
	border: 1px dotted #0000FF;
}
-->
</style>
<style type="text/css">
<!--
.destacado1 {
	font-family: Arial, Helvetica, sans-serif;
	font-size: medium;
	font-weight: bold;
	color: #000000;
	text-decoration: none;
}
-->
</style>
</head>
<body>
<p class="titular">MANUAL DEL PROGRAMA BULMAGES</p>
<p>Julio-Agosto 2003 (C) Cristina Marco Hernandez</p>
  <br> 
    <span class="titular">INTRODUCCIÓN</span>
  
  <br> 
    <br><p>Hace algunos millones de a&ntilde;os empez&oacute; la vida en la tierra, 
        pero no creo que debamos retroceder tanto en el tiempo para explicar los 
        or&iacute;genes de este programa.</p>
      <p>En los meses de Junio, Julio del 2001 surgi&oacute; en la lista de distribuci&oacute;n 
        de Bulma, la idea de realizar programas de gesti&oacute;n para empresas. 
        El objetivo era claro, hacer posible el uso de Linux en el dia a dia de 
        una empresa. Para ello es preciso que las empresas cuenten con software 
        de calidad que les permita abordar todas las tareas que ya tienen informatizadas.</p>
      <p>Luego, con el tiempo fue escogido como primer candidato a ser implementado 
        una contabilidad por los siguientes motivos:</p>
      <p> <LI> Es un programa aislado, que s&oacute;lo influye a un departamento, 
        no es vital para el funcionamiento de la empresa, no es necesario migrar 
        todo el parque inform&aacute;tico de la empresa para utilizar BulmaGes, 
        basta con un ordenador</LI></p>
      <p><LI> Los requisitos para un programa contable estan bien definidos y son 
        pr&aacute;cticamente los mismos para cualquier empresa, con lo que el 
        programa seria mayormente utilizado que cualquier otro candidato.</LI></p>
      <p><LI> No existia ning&uacute;n programa que atacase a la contabilidad, aun 
        hoy dia existen muy pocas alternativas reales. Y la mayoria de los proyectos 
        dedicados a ello han quedado olvidados.</LI></p>
      <p>Tras dos a&ntilde;os de aparente inmovilidad del proyecto, por fin, en 
        Noviemgre de 2002 se empez&oacute; la codificaci&oacute;n del programa.</p>

<p>&nbsp;</p>
    <br>
      
    <span class="titular">INSTALACI&Oacute;N DE BULMAGES</span>
   
    <br>
      
    <br><span class="subtitular1" style="font-weight: bold;">A.- Instalaci&oacute;n R&aacute;pida 
      </span><br>
      <br>
<li>El primer paso para instalar un programa es descargarlo, puede obtener
un archivo tgz con todos los archivos necearios para el programa en
http://bulmages.bulma.net</li><br>
      <p><li>Descomprimir
el archivo tgz en un directorio</li></p>
      <p><li>Ejecutar
como root el script de instalaci&oacute;n install-bulmages</li></p>
      
<p><li>Asegurarse de que el directorio /usr/local/bin se encuentra en el path.</li></p>
<p> <li>Para arrancar el programa basta con escribir bulmages.</li></p>
      
<p class="subtitular2">Requisitos del programa:</p>
<p>Para el correcto funcionamiento del programa se requiere:</p>
      <li>postgresql</li>
      <li>kde3.x </li>
      <li>libpq</li>
      
<p ><span class="destacado1">Nota:</span><br>
&nbsp;&nbsp;&nbsp; Revise el apartado de Configuraci&oacute;n del motor
de bases de datos PostgreSQL de esta misma secci&oacute;n para
comprobar que tiene las bases de datos correctamente instaladas.<br>
      <br>
      </p>
      
<p ><span class="subtitular1">B.- Instalaci&oacute;n Manual</span><br>
</p>
<p >Vamos a intentar detallar todos los requisitos necesarios para 
  poner en funcionamiento el programa, sin tener que hacer uso del script de instalaci&oacute;n. 
  De esta forma entenderemos mejor los componentes del programa.</p>
<p ><br></span>
  Esta instalaci&oacute;n es algo m&aacute;s laboriosa pero permite tener mayor 
  control sobre los componentes de la aplicaci&oacute;n. No es preciso ejecutar 
  el script de instalaci&oacute;n installbulmages para que funcione, pero si es 
  preciso tener acceso de root en la m&aacute;quina en la que vayamos a instalar.<br>
</p>
      <p ></p>
      <h4><span class="subtitular2">&nbsp; B1.- Instalaci&oacute;n de los servicios. 
        </span><br>
      </h4>
      Supondremos que tenemos el
servidor de postgresql instalado y correctamente configurado. Para
instalar las bases de datos requeridas para que funcione
Bulmag&eacute;s podemos acceder al directorio dbmodels y buscar en ella
tres archivos de bases de datos (pgdump).
Si nuestro usuario no esta dado de alta en postgres podemos hacerlo
mediante el comando (supondremos que el usuario tborras no tiene
permisos para acceder a bases de datos de postgres):<br>

      <p class="codigo">
      /root/:# su postgres</span><br
 style="font-style: italic;">
      /home/postgres:$ createuser tborras</span></p>
      <br>
El primer comando hace que el sistema entre en la cuenta de
superusuario de postgres, de esta forma podemos ejecutar comandos en la
base de datos.<br>
El segundo comando crea el usuario tborras, para que pueda acceder a la
base de datos.<br>
      <br>
Tras estos dos comandos se nos haran algunas preguntas sobre si
queremos que nuestro usuario pueda crear nuevas bases de datos
(Responderemos que SI).<br>
      <br>
Hecho esto ya podemos crear las bases de datos del programa mediante
los comandos:<br>
      <br>
      <p class="codigo"">/home/tborras:$ createdb bulmages<BR> 
     /home/tborras:$ createdb metabd<BR>
	 /home/tborras:$ createdb bgplangcont</p>
      <br>
Si todo ha funcionado bien el sistema nos devolver&aacute; el mensaje
CREATE DATABASE indicando que la base de datos ha sido creada<br>
      <br>
      Luego podemos volcar los datos que se suministran con la instalaci&oacute;ndel 
      programa<br>
      <br>
      <p class="codigo">/home/tborras:$ psql bulmages
&lt; bulmages.pgdump<br style="font-style: italic;">
      /home/tborras:$ psql metabd
&lt; metabd.pgdump<br style="font-style: italic;">
      /home/tborras:$ psql
bgplangcont &lt; bgplangcont.pgdump</p>
      <br>
Estos comandos deben generar bastante salida en pantalla.<br>
Si todo ha ido correctamente, y no ha salido ningun mensaje de error,
en el sistema estar&aacute;n creadas las bases de datos que va a
utlizar el programa.<br>
      <br>
Si se ha producido alg&uacute;n error, o queremos volver a instalar
siempre podemos borrar la base de datos con el comando:<br>
      <br>
      <p class="codigo"">/home/tborras:$ dropdb bulmages</p><br
 style="font-style: italic;">
      <br>
Lea el manual de referencia de postgreSQL para mayor informaci&oacute;n
sobre la administraci&oacute;n de bases de datos.<br>
      <br>
      <h4><span class="subtitular2">B2.- Instalaci&oacute;n del cliente de contabilidad</span><br>
      </h4>
      <h4><span style="font-weight: normal;">Para instalar el cliente
de contabilidad lo &uacute;nico que debemos hacer es copiar una serie
de archivos en determinadas ubicaciones.</span></h4>
copiar bulmages.conf en el directorio etc/<br>
Este es el archivos de configuracion del programa y debe tener permisos
de lectura.<br>
      <br>
copiar bulmages, borraremp, cargaemp, guardaemp y nuevaemp en
/usr/local/bin<br>
Estos archivos son los ejecutables y deben tener permisos de
ejecuci&oacute;n., igualmente el directorio /usr/local/bin debe estar
en el PATH para que pueda ser ejecutado.<br>
      <br>
copiar el resto de archivos en /usr/share/bulmages<br>
Estos archivos son archivos auxiliares del programa y deben tener
permisos de lectura.<br>
      <br>
Es posible que la parte cliente y la parte servidor est&eacute;n
alojadas en distintas m&aacute;quinas. Incluso puede tener varios
clientes atacando a una misma base de datos. Para hacerlo&nbsp; existen
dos parametros en el archivo&nbsp; /etc/bulmages.conf que indican a que
servidor de bases de datos debe atacar el programa.Estos parametros son
CONF_SERVIDOR y CONF_PUERTO donde se puede indicar a que servidor de
bases de datos y puerto de conexi&oacute;n hacer las peticiones de base
de datos.<br>
      <br>
      <h4 class="subtitular1">C.- Configuraci&oacute;n del motor de bases de datos
PostgreSQL:</h4>
      <p></p>
      <p >La mayor complicaci&oacute;n que puede surgir
con el programa es la correcta instalaci&oacute;n de las bases de datos.</p>
      <p  class="subtitular2"><strong>C1.-Permisos de los usuarios:</strong></p>
      <p >Postgres trabaja con varios m&eacute;todos de
autentificaci&oacute;n, estas opciones se configuran en el archivo
pg_hba.conf. Esta es la principal causa de problemas con el programa.</p>
      <p >La opci&oacute;n de autentificaci&oacute;n <strong>trust</strong>
permite que todos los usuarios tengan acceso a la base de datos con lo
que no habr&aacute; problemas de autentificaci&oacute;n y todos los
usuarios podran utilizar sin restricciones las bases de datos. Asi que
si tenemos el tipo de acceso trust y las bases de datos de la
aplicaci&oacute;n han sido creadas el programa funcionar&aacute; sin
problemas.</p>
      <p >La opci&oacute;n de autentificaci&oacute;n <strong>ident
sameuse</strong>r s&oacute;lo permite que tengan acceso a la base de
datos aquellos usuarios que han sido creados previamente. Esta
opci&oacute;n es m&aacute;s segura ya que solo aquellos usuarios que
tengan cuenta en el ordenador tendran acceso a las bases de datos. Para
usar bulmages con este modelo de autentificaci&oacute;n debemos
asegurarnos que los usuarios que van a usar el programa han sido dados
de alta en la base de datos. Para ello usaremos el comando</p>
      <p  class="codigo"">/home/postgres:$
create user xxxxxxxx</p>
      <p >donde xxxxxxxxx es el login del usuario al que
queremos otorgar permisos de acceso a la base de datos.</p>
      <p >&nbsp;</p>
      <p ></p>

<HR>



    <br>
      <span class="titular">EJECUCI&Oacute;N DEL PROGRAMA BULMAGES</span>
    
    <br>
      <br>
      <p><font size="2" face="Verdana, Arial, Helvetica, sans-serif">Una
vez que el programa ha sido correctamente configurado, podemos pasar a
ejecutarlo.<br>
      </font></p>
      <div style="text-align: center;"><font size="2"
 face="Verdana, Arial, Helvetica, sans-serif"><img
 src="imgmanual/splash.png" title=""
 alt="splash de la version 0.3.1" style="width: 449px; height: 357px;"></font><br>
      </div>
      <p><font color="#663333" size="2"
 face="Verdana, Arial, Helvetica, sans-serif">El prgrama se ejecuta
mediante el comando bulmages.</font><font size="2"
 face="Verdana, Arial, Helvetica, sans-serif">&nbsp; Una vez ejecutado
nos aparecera una pantalla de entrada donde podemos pulsar sobre la
empresa en la cual queremos trabajar y nos pedir&aacute; un login y un
password. Por defecto el programa tiene el usuario bulmages predefinido
y su password es bulmages.</font></p>
      
    
  



<HR>

    <br>
      
    <span class="titular">PRIMEROS PASOS CON EL PROGRAMA</span>
    
    <br>
      
    <span class="subtitular1">INTRODUCCI&Oacute;N 
      AL PROGRAMA</span>
    
    <br>
      <br>
      <div ><font size="2"
 face="Verdana, Arial, Helvetica, sans-serif">BulmaGes es un proyecto
dedicado a resolver la tarea de la contabilidad de empresa de una forma
sencilla y elegante y siempre bajo el punto de vista del Software Libre.</font></div>
      
    
    <br>
      
    <span class="subtitular1">LA PANTALLA DE INICIO: ABRIR EMPRESA</span>
    
    <br>
      <br>
        
          <br>
            <br>
            <div ><font size="2"
 face="Verdana, Arial, Helvetica, sans-serif">La pantalla de INICIO
permite seleccionar la EMPRESA con la que se desee trabajar. Esta
pantalla incluye el nombre que se le haya proporcionado a la empresa,
el ejercicio al que se refiere y el nombre del archivo en el que se
guardar&aacute;n los datos relativos al ejercicio en curso.</font></div>
            
          
          <br>
            <br>
            <div ><font size="2"
 face="Verdana, Arial, Helvetica, sans-serif">Para comenzar a utilizar
BULMAGES ser&aacute; necesario ABRIR una EMPRESA. Bulmages incluye por
defecto un plan contable est&aacute;ndar, una empresa de pruebas y la
configuraci&oacute;n de un usuario "bulmages". Por lo tanto, para
acceder por primera vez al programa ser&aacute; necesario seleccionar
la EMPRESA DE PRUEBAS (bulmages )y el usuario "bulmages" por defecto.</font></div>
            
          
          <br>
            <br>
            <div ><font size="2"
 face="Verdana, Arial, Helvetica, sans-serif">Los campos LOGIN y
PASSWORD permanecer&aacute;n vac&iacute;os por defecto. Para el usuario
bulmages debe introducir :<br>
LOGIN: bulmages<br>
PASSWORD: bulmages<br>
            </font></div>
            
          
          <br>
            <br>
            <div ><font size="2"
 face="Verdana, Arial, Helvetica, sans-serif">En el caso de que ya se
hayan creado diferentes empresas, para comenzar a operar con el
programa, deber&aacute; seleccionar la EMPRESA con la que quiera
trabajar e introducir despu&eacute;s el LOGIN y el PASSWORD de un
usario que tenga acceso a dicha empresa. <br>
            </font></div>
            
          
        
      
      
    


<HR>

  
    <br>
      <br><span class="titular"> PANTALLA PRINCIPAL</span>
    
    <br>
      <br>
      <div >La pantalla principal de
Bulmages le ofrece las opciones generales del programa en dos
modalidades: el men&uacute; superior y la barra de acceso r&aacute;pido
inferior. Dentro de la pantalla general se abren las pantallas
correspondientes a las opciones espec&iacute;ficas del programa (por
ejemplo, la pantalla de APUNTES CONTABLES, la GESTI&Oacute;N DE
ASIENTOS, etc.)</div>
      
    
    <br>
      <br>
      <div >Al iniciar una
sesi&oacute;n de trabajo en una EMPRESA seleccionada en BULMAGES,
aparece la pantalla principal que abre por defecto las siguientes
subpantallas:</div>
      
    
    <br>
      <br>
      <div >- INTRODUCCION DE APUNTES
CONTABLES </div>
      
    
    <br>
      <br>
      <div >- LIBRO DIARIO DE APUNTES</div>
      
    
    <br>
      <br>
      <div >- LIBRO MAYOR u EXTRACTO
DE CUENTAS</div>
      
    
    <br>
      - BALANCE DE CUENTAS.<br>
      
    
    <br>
      - BALANCE JER&Aacute;RQUICO.<br>
      

<HR>

  <br> 
    <span class="titular">GESTI&Oacute;N DE EMPRESAS</span>
  
  <br> 
    <br> <div >BULMAGES puede trabajar con tantas 
        empresas como el usuario desee, asignando as&iacute; a cada empresa el 
        ejercicio econ&oacute;mico que corresponda. El men&uacute; EMPRESA consta 
        de las siguientes opciones:</div>
  
  <br> 
    <span class="subtitular1" style="vertical-align: top;">ABRIR EMPRESA</span>
  
  <br> 
    Mediante esta opci&oacute;n usted puede crear 
      el asiento de apertura de una empresa. Notese que para crear el asiento 
      de apertura de una empresa es preciso que el &uacute;ltimo asiento introducido 
      sea el asiento de cierre de la empresa.<br> <br>
      Vd puede generar tantos asientos de apertura y de cierre como desee durante 
      el ejercicio contable.<br> 
  
  <br> 
    <span class="subtitular1" style="vertical-align: top;">CERRAR EMPRESA</span>
  
  <br> 
    Mediante esta opci&oacute;n usted puede crear 
      el asiento de cierre de la empresa.<br> 
  
  <br> 
    <span class="subtitular1" style="vertical-align: top;">REGULARIZAR EMPRESA</span>
  
  <br> 
    Regularizar una empresa es el asiento previo 
      al asiento de cierre, con este asiento se desplazan los resultados del ejercicio 
      a la cuenta de perdidas y ganancias.<br> 
  
  <br> 
    <span class="subtitular1">NUEVA EMPRESA</span>
  
  <br> 
    <br> <div >Permite a&ntilde;adir una nueva 
        empresa con su correspondiente ejercicio contable.</div>
  
  <br> 
    <br> <div >Para crear una nueva empresa es 
        necesario acceder al men&uacute; EMPRESA y seleccionar la opci&oacute;n 
        de NUEVA EMPRESA.</div>
  
  <br> 
    &nbsp;<img
 src="imgmanual/nempresa.png" title=""
 alt="nueva empresa" style="width: 595px; height: 422px;">
  
  <br> 
    Al crear una nueva empresa, se nos pide el 
      nombre de la empresa, el nombre de la base de datos que la va a contener 
      y el ejercicio que se va a introducir.<br>
      Podemos, en la misma ventana, asignar los diferentes usuarios que tienen 
      permisos de acceso a la empresa y el tipo de acceso (lectura o modificaci&oacute;n).<br>
      La creaci&oacute;n de una empresa implica la creaci&oacute;n de una base 
      de datos nueva, por tanto el usuario que ejecuta el programa debe tener 
      privilegios para crear bases de datos en postgres.<br> 
  
  <br> 
    <span class="subtitular1">BORRAR EMPRESA</span>
  
  <br> 
    <br> <div >Le permite borrar una empresa existente 
        de forma definitiva, incluyendo todos los datos que se hayan introducido 
        hasta el momento.<br>
        Para borrar una empresa, primero debemos seleccionar la empresa que queremos 
        borrar. Luego mediante esta opci&oacute;n del menu la empresa abierta 
        ser&aacute; borrada autom&aacute;ticamente.<br>
        </div>
  
  <br> 
    <br>&nbsp;
  
  <br> 
    <span class="subtitular1">CAMBIAR EMPRESA</span>
  
  <br> 
    <br> <div >Mediante esta opci&oacute;n puede 
        cambiar la empresa activa a otra empresa diferente a la seleccionada en 
        la PANTALLA DE INICIO: ABRIR EMPRESA siempre que la empresa haya sido 
        creada anteriormente. Puede cambiar de empresa tantas veces como desee 
        siempre y cuando no est&eacute; en mitad del proceso de introducci&oacute;n 
        de datos.<br>
        <br>
        La ventana de cambio de empresa es la misma que la de apertura de empresa, 
        es decir, la ventana que aparece tras ejecutar el programa. Notese que 
        tambi&eacute;n se puede cambiar el usuario mediante esta ventana.<br>
        </div>
  
  <br> 
    &nbsp;<img
 src="imgmanual/cambiaempresa.png" title=""
 alt="cambiar empresa" style="width: 398px; height: 234px;">
  
  <br> 
    <br><span class="head1"><img src="imgbotones/boton_propempresa.gif" width="24" height="25"> 
      </span><span class="subtitular1">PROPIEDADES EMPRESA</span>
  
  <br> 
    <br> <div >Permite consultar y modificar los 
        par&aacute;metros especificados para la empresa activa.</div>
  
  <br> 
    &nbsp;<img
 src="imgmanual/propempresa.png" title=""
 alt="propiedades empresa" style="width: 591px; height: 410px;">
  
  <br> 
    Mediante esta pantalla Vd. puede cambiar 
      parametros de configuraci&oacute;n de la empresa. Estos parametros son:<br> 
      <br>
      El numero de d&iacute;gitos que por defecto tienen las cuentas, la cuenta 
      de regularizaci&oacute;n de la empresa y los permisos que tienen los usuarios 
      sobre la empresa.<br> 
  
  <br> 
    <span class="subtitular1">GUARDAR EMPRESA</span>
  
  <br> 
    <br>Permite hacer una copia de seguridad 
        de la empresa activa. La empresa entera es guardado en un archivo.<br>
        </div>
  
  <br> 
    <span class="subtitular1">CARGAR EMPRESA</span>
  
  <br> 
    <br> Opci&oacute;n para restaurar una 
        copia de seguridad realizada con anterioridad de la empresa seleccionada 
        o para a&ntilde;adir los datos de otra empresa.</div>
  
	
	
	<HR>
	
<br>
    <br>
      
    <big><big><big><span
 style="color: rgb(0, 0, 153); font-weight: bold;"><img src="imgbotones/boton_usuarios.gif" width="24" height="24"><span class="titular">GESTION 
      DE USUARIOS</span></span></big></big></big>
    
    <br>
      Mediante el bot&oacute;n <img src="imgbotones/boton_usuarios.gif" width="24" height="24"> 
        del toolbar, o la opci&oacute;n del menu Empresa Vd puede gestionar los 
        usuarios. Crear, borrar y modificar los usuarios que tienen acceso al 
        programa.<br>
      <div style="text-align: center;"><img
 src="imgmanual/usuarios.png" title=""
 alt="gestion de usuarios" style="width: 608px; height: 373px;"><br>
      </div>
      
    
    <br>
     En la parte de la izquierda de
la ventana puede seleccinar el usuario que quiera editar y modificarlo
con los campos de la parte derecha. <br>
        Si teniendo un usuario seleccionado pulsa sobre el boton <img src="imgbotones/boton_borrar.gif" width="24" height="24">, 
        vd podra eliminar el usuario seleccionado.<br>
        Si pulsa sobre el boton <img src="imgbotones/boton_nuevo.gif" width="24" height="24"> 
        aparecer&aacute; un usuario nuevo en la parte izquierda que luego podr&aacute; 
        modificar con los datos que precise.<br>
      
    


<HR>

  
    
<div align="left">
  <p><br>
    <br>
    <span class="head1"><img src="imgbotones/boton_cuenta.gif" width="24" height="24"> 
    </span><span class="titular">PLAN CONTABLE</span> </p>
  <p><br>
  </p>
  <center>
  <img src="imgmanual/plancuentas.png" title="" alt="plan de cuentas" style="width: 597px; height: 454px;" align="center"><br>
  </center>
   <br>
  <br>
</div>
<div >Mediante esta pantalla podemos ver, 
          modificar y borrar todas las cuentas y subucentas del plan contable 
          de la empresa.<br>
          <br>
          El plan de cuentas es accesible mediante el boton <img src="imgbotones/boton_cuenta.gif" width="24" height="24"> 
          y mediante la opci&oacute;n Plan Contable del menu Cuenta<br>
          <br>
          Muestra el plan contable con el que trabja la empresa activa. Bulmages 
          se suministra con el Nuevo Plan General Contable B&aacute;sico por defecto, 
          pero ofrece la posibilidad de modificarlo y personalizarlo. De esta 
          forma, cada empresa puede operar con un plan contable particularizado.<br>
          La pantalla que se nos presenta dos pesta&ntilde;as:<br>
          &nbsp;&nbsp;&nbsp; <li>En la primera (Plan Contable) se puede ver un arbol 
          de cuentas de la empresa.</li><br>
          &nbsp;&nbsp;&nbsp;<li> En la segunda (Subcuentas) se puede ver un listado 
          de las subcuentas de la empresa.</li><br>
          <br>
          Para crear una nueva cuenta tenemos el boton <img src="imgbotones/boton_nuevo.gif" width="24" height="24">, 
          si pulsamos este boton teniendo seleccionada una cuenta, la cuenta que 
          creemos se pondr&aacute; como cuenta hija de la cuenta seleccionada.<br>
          <br>
          Podemos editar cualquier cuenta haciendo doble click en la cuenta deseada, 
          tambi&eacute;n podemos editarla seleccionandola y pulsando sobre el 
          boton <img src="imgbotones/boton_editar.gif" width="24" height="24">.<br>
          <br>
          Podemos borrar cualquer cuenta (que no tenga cuentas hijos, ni apuntes 
          contables apuntados en ella) seleccionandola y pulsando sobre el boton 
          <img src="imgbotones/boton_borrar.gif" width="24" height="24"> <br>
          </div>
      
    
    <br>
      <br><span class="subtitular1">EDICI&Oacute;N DE CUENTAS</span>
    
    <br>
	<center>
      <img
 src="imgmanual/edicuenta.png" title=""
 alt="edicion de cuentas" style="width: 600px; height: 381px;"></center><br>
      
    
    <br>
      Cuando creamos una cuenta nueva,
o editamos una cuenta existente nos aparece esta ventana. En ella
podemos ver todos los datos de la cuenta.<br>
La pesta&ntilde;a Otros Datos contiene informaci&oacute;n adicional de
la cuenta, como cuentas bancarias, nombres, cif's e-mails y datos de
contacto que se puedan necesitar para la cuenta.<br>
      
    



<hr>
  
    <br> 
      <br><span class="head1"><img src="imgbotones/boton_intapunts.gif" width="24" height="24"> 
        <img src="imgbotones/boton_asientos.gif" width="24" height="24"><span class="titular">ASIENTOS 
        / INTRODUCCION DE APUNTES</span></span>
    
	<BR><br>
      <img
 src="imgmanual/intapunts.png" title=""
 alt="introduccion de apuntes." style="width: 853px; height: 338px;"><br> 
    
    <br> 
      <br> Permite la introducci&oacute;n de  ASIENTOS.
    


    <br> 
      <br> La GESTI&Oacute;N DE ASIENTOS es 
          una de las partes principales del programa ya que los datos que se introduzcan 
          ser&aacute;n los que proporcionen despu&eacute;s la visi&oacute;n exacta 
          de la contabilidad. Es a partir de estos datos de los que BULMAGES obtiene 
          la informaci&oacute;n necesaria para elaborar los diferentes informes 
          o listados. Por ejemplo, el listado del DIARIO o el LIBRO DE MAYOR.
    
    <br> 
      <br>La pantalla de INTRODUCCI&Oacute;N 
          DE ASIENTOS se abre por defecto al inicializar el programa situando 
          la pantalla por defecto en el &uacute;ltimo N&Uacute;MERO DE ASIENTO 
          introducido. De esta forma se facilita la inserci&oacute;n de asientos 
          siguiendo un orden correlativo.<br>
          En el caso de que no haya ning&uacute;n asiento introducido previamente 
          (por ejemplo en empresas reci&eacute;n creadas) BULMAGES abrir&aacute; 
          la GESTI&Oacute;N DE ASIENTOS en el n&uacute;mero 1.
    
    <br> 
      <br>Para comenzar la ntroducci&oacute;n 
          de asientos habr&aacute; que comenzar por abrir el asiento mediante 
          el boton abrir asiento <span
 style="font-weight: bold;">#boton# </span>o el icono de acceso r&aacute;pido 
          . Una vez en la pantalla, se debe pulsar el bot&oacute;n de SIGUIENTE 
          (flecha). Al pulsar esta opci&oacute;n, BULMAGES detectar&aacute; que 
          se desea crear un asiento nuevo y preguntar&aacute;: "No existe un asiento 
          con el n&uacute;mero que ha proporcionado, &iquest;desea crear uno?". 
          Esto significa que el programa crear&aacute; un nuevo asiento con un 
          n&uacute;mero correlativo al anterior.<br>
          Una vez abierto un nuevo asiento, el fondo de la pantalla cambia a color 
          blanco y el programa permite la permite la introducci&oacute;n de datos 
          en los diferentes campos disponibles.
    
    <br> 
      <br>La introducci&oacute;n de asientos 
          puede realizarse mediante la introducci&oacute;n libre de los datos 
          directamente en la pantalla principal. Para agilizar el proceso, el 
          programa permite cambiar de una opci&oacute;n a otra con el teclado 
          y sin la necesidad de recurrir al rat&oacute;n.
    
    <br> 
      <br>Bulamges le ofrece tambi&eacute;n 
          la posibilidad de introducir los asientos en dos modalidades diferentes.<br>
          Los ASIENTOS SIMPLES consisten en insertar los datos en el programa 
          PARTIDA por PARTIDA.<br>
          Los ASIENTOS INTELIGENTES o PREDEFINIDOS son aquellos que, habiendo 
          establecido con anterioridad sus propiedades, facilitan la introducci&oacute;n 
          de asientos repetidos o usuales en la contabilidad, como por ejemplo 
          pagos mensuales a proveedores, gestiones usuales con el banco, etc. 
          Usted puede crear tantos ASIENTOS INTELIGENTES como desee estableciendo 
          los valores que considere oportunos para cada uno de ellos
    
    <br> 
      Hay diversos par&aacute;metros de esta 
        ventana que son cofigurables a trav&eacute;s del archivo de configuracion 
        del programa (ver secci&oacute;n bulmages.conf), usted podr&aacute; cambiar 
        la tipografia de la fuente y los colores de la fuente. Tambi&eacute;n 
        podr&aacute; elegir mostrar o no mostrar determinados campos.<br> 
    
    <br> 
      <br><big style="font-weight: bold;"><span
 style="color: rgb(0, 0, 153);">&nbsp;<span class="subtitular1">NAVEGACION A TRAVES 
        DEL SISTEMA DE APUNTES</span></span></big><br> 
    
    <br> 
      Puede navegar a trav&eacute;s de los asientos 
        introducidos mediante los botones de flecha en las toolbars. De esta forma 
        puede acceder al boton siguiente y anterior, al primer y al ultimo asiento. 
        Segun su orden de creaci&oacute;n.<br> 
    
    <br> 
      <big style="font-weight: bold;"><span
 style="color: rgb(0, 0, 153);"><img src="imgbotones/boton_filtrar.gif" width="24" height="24"> 
        <span class="subtitular1">FILTRADO DE ASIENTOS</span></span></big><br> 
      
    
    <br> 
      Puede interesarle trabajar con una serie 
        de asientos que cumplan unas caracter&iacute;sticas determinadas. Puede 
        que su trabajo sea m&aacute;s sencillo si mediante la navegaci&oacute;n 
        s&oacute;lo se presentan aquellos asientos que cumplan unas caracter&iacute;sticas 
        determinadas. Para ello puede establecer un filtro que haga que s&oacute;lo 
        se presenten los asientos que cumplan determinadas caracter&iacute;sticas 
        con el bot&oacute;n <img src="imgbotones/boton_filtrar.gif" width="24" height="24"> 
        situado en las toolbars.<br>
        Inmediatamente aparecer&aacute; la ventana siguiente que le permite establecer 
        los criterios del filtro.<br>
        Si tiene un filtro puesto y desea quitarlo, en dicha ventana tiene un 
        bot&oacute;n de reset que quita todos los parametros del filtro y le mostrar&aacute; 
        todos los asientos existentes.<br> <br> <div style="text-align: center;"><img
 src="imgmanual/filtroasiento.png" title=""
 alt="filtrado de asientos." style="width: 608px; height: 203px;"><br>
        </div>
    
      <br> <div  class="subtitular1">ASIENTOS SIMPLES</div>
    
    <br> 
      <br> <br> 
    
    <br> 
      <br> <div >Para introducir asientos simples 
          tan s&oacute;lo es necesario abrir un asiento o crear uno nuevo tal 
          y como se ha explicado anteriormente.<br>
          Una vez que la pantalla le deja modificar / introducir datos:<br>
          <br>
          La pantalla que nos muestra el asiento presenta todos los apuntes que 
          componen al mismo en forma de filas de una tabla. Cada fila se corresponde 
          con un apunte.<br>
          Cada apunte se compone de los siguientes campos:<br>
          <br>
          <span style="font-weight: bold; color: rgb(51, 51, 255);">FECHA:</span> 
          La fecha del apunte indica la fecha en que se realiza la transacci&oacute;n 
          econ&oacute;mica. La fecha puede introducirse de distintas formas:<br>
          &nbsp;&nbsp;&nbsp; Escribiendo la fecha en cualquier de las siguientes 
          formas: DDMMAA, DDMM, DDMMAAAA, DD/MM/AA, DD/MM/AAAA. Al pulsar enter 
          (tras haber introducido la fecha, se cambiar&aacute; el formato de &eacute;sta 
          al formato estandar DD/MM/AAAA.<br>
          &nbsp;&nbsp;&nbsp; Otra forma de introducir la fecha es pulsando la 
          techa + cuando estamos editando dicho campo. Automaticamente nos aparecer&aacute; 
          una ventana con un calendario en el que podremos seleccionar la fecha 
          que deseamos. Esta misma opci&oacute;n aparece al pulsar con el bot&oacute;n 
          derecho sobre la fecha y seleccionando del menu contextual la opcion 
          "Seleccionar Valor"<br>
           
          <div style="text-align: center;"><img
 src="imgmanual/calendario.png" title=""
 alt="calendario" style="width: 198px; height: 173px;"></div>
          &nbsp;&nbsp;&nbsp; 
          Editando el campo de fecha, si pulsamos sobre la tecla * automaticamente 
          se pondr&aacute; en el campo que estamos editando el mismo valor que 
          el campo de fecha anterior.<br>
          <br>
          <br>
          <span style="color: rgb(51, 51, 255); font-weight: bold;">SUBCUENTA:</span><span
 style="font-weight: bold;"> </span>La introducci&oacute;n de cuentas puede hacerse 
          de diversas formas: <br>
          &nbsp;&nbsp;&nbsp; Escribiendo la cuenta mediante el teclado. Tambi&eacute;n 
          podemos introducir la cuenta de forma abreviada, la cuenta 1000004 puede 
          introducirse de la forma 1.4, y la cuenta 1000000 puede introducirse 
          de la forma "1."&nbsp; El sistema&nbsp; extender&aacute; el . de forma 
          que el numero de cuenta tenga el n&uacute;mero de d&iacute;gitos que 
          se usan por defecto en la contabilidad de la empresa.<br>
          &nbsp;&nbsp;&nbsp; Otra forma de introducir cuentas es pulsando la tecla 
          + o la opcion elegir valor en el menu contextual, directamente aparecer&aacute; 
          la ventana del plan de cuentas, con la salvedad que al hacer doble click 
          sobre una cuenta &eacute;sta aparecer&aacute; en el la casilla que estamos 
          editando.<br>
          &nbsp;&nbsp;&nbsp; Editando el campo de subcuenta, si pulsamos sobre 
          la tecla * automaticamente se pondr&aacute; en el campo que estamos 
          editando el mismo valor que el campo de subcuenta anterior. (Notes&eacute; 
          que las teclas seleccionadas sirven para hacer la introducci&oacute;n 
          sin dejar de tocar el teclado num&eacute;rico).<br>
          &nbsp;&nbsp;&nbsp; Si lo desea, puede acceder de forma r&aacute;pida 
          a ver el extracto de una subcuenta que este visualizando en la ventana 
          de apuntes. Para ello el asiento debe estar cerrado, y pulsando con 
          el bot&oacute;n derecho sobre la cuenta de la que quiera ver su extracto 
          puede seleccionar la opci&oacute;n ver extracto. Adem&aacute;s el programa 
          de permitira escoger entre ver un extracto total, un extracto del mes 
          en que esta introducido el apunte o un extracto del dia de introducci&oacute;n 
          del apunte.<br>
          <br>
          <br>
          <span style="color: rgb(51, 51, 255); font-weight: bold;">CONTRAPARTIDA:</span><span
 style="font-weight: bold;"> </span>(Puede que en su configuraci&oacute;n del 
          programa no aparezca el campo de contrapartida, ver secci&oacute;n de 
          bulmages.conf).<br>
          &nbsp;&nbsp;&nbsp; La introducci&oacute;n de contrapartida es similar 
          en funciones a la introducci&oacute;n de subcuenta.<br>
          &nbsp;&nbsp;&nbsp; La contrapartida, es semi-autom&aacute;tica, el programa 
          siempre elige de forma inteligente una contrapartida para todo apunte 
          introducido, puede ver dicha contrapartida a trav&eacute;s de un extracto 
          o un diario. Puede darse el caso de que la contrapartida elegida no 
          sea la apropiada, entonces puede introducir la contrapartida correcta 
          en el asiento mediante este campo. Entonces el programa dar&aacute; 
          preferencia a la contrapartida que usted ha introducido.<br>
          <br>
          <span style="color: rgb(51, 51, 255);"><span
 style="font-weight: bold;">DEBE / HABER:</span> </span>Puede introducir&nbsp; 
          directamente un valor en el campo de debe o de haber, pero solo en uno 
          de ellos, el otro debe vale obligatoriamente cero.<br>
          &nbsp;&nbsp;&nbsp; &nbsp;&nbsp; Si pulsa la tecla + en uno de estos 
          dos campos el valor de descuadre del asiento ser&aacute; asignado a 
          dicho campo.<br>
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Si pulsa la tecla * el campo coger&aacute; 
          el mismo valor que el campo anteriormente introducido.<br>
          <br style="color: rgb(51, 51, 255); font-weight: bold;">
          <span style="color: rgb(51, 51, 255); font-weight: bold;">CONCEPTO:</span> 
          El concepto es una descripci&oacute;n del apunte, no tiene m&aacute;s 
          que introducir un texto explicativo del mismo. (De momento en dicho 
          texto no estan permitidas las teclas * y +).<br>
          &nbsp;&nbsp;&nbsp; Si pulsa la tecla * estando editando dicho campo, 
          el campo coger&aacute; el mismo valor que su predecesor.<br>
          <br>
          <span style="color: rgb(51, 51, 255); font-weight: bold;">IVA:</span> 
          La introducci&oacute;n de IVA debe realizarse mediante el boton #IVA#, 
          y normalmente se hace de forma autom&aacute;tica al cerrar el asiento. 
          Este campo aparece aqui para indicar que dicho apunte lleva asociada 
          una entrada en el registro de IVA.<br>
          <br>
          <span style="color: rgb(51, 51, 255); font-weight: bold;">CENTRO DE 
          COSTE:</span> Aun por documentar<br>
          <br>
          <span style="color: rgb(51, 51, 255); font-weight: bold;">CANAL:</span> 
          Aun por documentar<br>
          </div>
    
    <br> 
      Los apuntes en el asiento pueden ser alterados 
        en su orden, mediante la combinaci&oacute;n de teclas CTRL + ARRIBA y 
        CTRL + ABAJO puede subir o bajar un apunte determinado. (Tambi&eacute;n 
        dispone de esta opci&oacute;n en el menu contextual que aparece al pulsar 
        con el boton derecho sobre el apunte).<br> <br>
        Puede querer borrar un apunte determinado. Para ello pulse con el bot&oacute;n 
        derecho del rat&oacute;n sobre el y haga click sobre la opci&oacute;n 
        de<span
 style="font-family: verdana,arial,helvetica,sans-serif;"> borrar apunte.<br>
        <br>
        En determinados casos le interesar&aacute; duplicar un apunte, para ello 
        tambi&eacute;n dispone de una opci&oacute;n en el menu contextual.<br>
        </span>
    
    <br> 
      <br> <div >Es recomendable rellenar todos los datos para 
          que, posteriormente, pueda comprender mejor los listados e informes 
          que puede proporcionarle el programa.</div>
    
    <br> 
      <br> <div >Si despu&eacute;s de cerrar el asiento desea modificarlo, 
          puede hacerlo mediante la opci&oacute;n de ABRIR CANDADO.</div>
    
    <br> 
      <br> <div >En el caso de que el ASIENTO quede descuadrado, 
          el programa le avisar&aacute; cuando intente cerrar el asiento con un 
          mensaje que le permite volver a la edici&oacute;n del asiento o bien 
          guardarlo ABIERTO para su posterior modificaci&oacute;n y cierre. Los 
          asientos abiertos no intervienen en los listados contables. Por lo que 
          es recomendable tener bien controlados los asientos que ha dejado abiertos.<br>
        </div>
    
    <br> 
      <br> <div >BULMAGES le permite a&ntilde;adir a cada asiento 
          tantos apuntes como considere necesario siempre y cuando el resultado 
          final quede cuadrado.</div>
    
    <br> 
      <br> <div ></div>
        Puede que desee cambiar la fecha de un asiento ya introducido, o escribir 
        algun comentario sobre dicho asiento, incluso cambiar el n&uacute;mero 
        de asiento, para ello dispone de la ventana de edici&oacute;n de asientos 
        pulsando sobre el bot&oacute;n <img src="imgbotones/boton_editar.gif" width="24" height="24">, 
        donde aparecer&aacute; la siguiente ventana que le permite cambiar todos 
        los datos mencionados.<br> <div style="text-align: center;"><img
 src="imgmanual/detallasiento.png" title=""
 alt="detalle del asiento" style="width: 509px; height: 252px;"><br>
        </div>
    
    <br> 
      Bulmag&eacute;s dispone de un listado r&aacute;pido 
        de asientos. Con dicho listado puede ver todos los asientos introducidos 
        en el sistema de forma r&aacute;pida, si estan abiertos o cerrados, e 
        incluso el saldo deudor y acreedor de los mismos. Este listado le puede 
        ser &uacute;til a la hora de verificar el sistema contable. Puede acceder 
        a dicho listado mediante el boton <img src="imgbotones/boton_asientos.gif" width="24" height="24"><br> 
        <br> <div style="text-align: center;"><img
 src="imgmanual/listasientos.png" title=""
 alt="listado de asientos" style="width: 521px; height: 382px;"><br>
        </div>
    
    <br> 
      <span style="vertical-align: top;"><img src="imgbotones/boton_ainteligente.gif" width="24" height="24"><span class="subtitular1">ASIENTOS 
        INTELIGENTES</span><br>
    
    <br> 
      <span class="subtitular2" style="vertical-align: top;">INTRODUCCION DE ASIENTOS MEDIANTE 
        ASIENTOS INTELIGENTES</span>
    
    <br> 
      Puede introducir un asiento completo, pulsando 
        sobre el boton #boton asiento inteligente#, el asiento debe estar abierto 
        para que se haga la introducci&oacute;n de un asiento inteligente. Autom&aacute;ticamente 
        aparecera la siguiente pantalla:<br> <br> <div style="text-align: center;"><img
 src="imgmanual/ainteligente.png" title=""
 alt="asiento inteligente" style="width: 608px; height: 279px;"><br>
          <br>
          <div style="text-align: left;">En la parte superior, puede seleccionar 
            la plantilla a utilizar para la introducci&oacute;n del apunte. En 
            la parte inferior se pediran los datos necesarios para la confeccion 
            del asiento. <br>
            Una vez rellenados los datos, puede darle al bot&oacute;n aceptar 
            y automaticamente se crear&aacute;n los apuntes que forman el asiento 
            en el asiento abierto.<br>
            Puede introducir tantos asientos inteligentes como desee en un mismo 
            asiento.<br>
          </div>
        </div>
    
    <br> 
      <span style="vertical-align: top;"><big><span
 style="color: rgb(0, 0, 153); font-weight: bold;"><img src="imgbotones/boton_ainteligente.gif" width="24" height="24"><span class="subtitular1">CREACION 
        DE ASIENTOS INTELIGENTES</span></span></big><br> 
    
    <br> 
      Puede crear tantos asientos inteligentes 
        como precise para su contabilidad.Para ello dispone de la opci&oacute;n 
        #boton asientos inteligentes# en las toolbars y en el menu de la aplicaci&oacute;n.<br> 
        <br>
        Automaticamente aparecer&aacute; la siguiente pantalla:<br> <br> <div style="text-align: center;"><img
 src="imgmanual/ainteligentecreacion.png"
 title="" alt="creacion de asientos inteligentes."
 style="width: 942px; height: 332px;"><br>
        </div>
    
    <br> 
      La creaci&oacute;n de nuevos asientos inteligentes 
        funciona como la introducci&oacute;n de un asiento, con la salvedad de 
        que en los campos en los que sea preciso puede introducir variables o 
        operaciones con variables.<br>
        Para hacer que un campo determinado del asiento sea variable basta con 
        introducir el nombre de variable entre signos de dolar. Esto provocar&aacute;&nbsp; 
        que para introducir dicho valor sea preguntado en la plantilla. Tambi&eacute;n 
        puede operar variables introduciendo una formula que use la variable y 
        en la creaci&oacute;n del asiento se pondr&aacute; el resultado de la 
        operaci&oacute;n.<br> <br>
        Existen variables predefinidas por el programa, que, aun siendo variables, 
        no provocan que el sistema pregunte por ellas ya que son calculadas de 
        forma autom&aacute;tica.<br>
        Por ejemplo:<br> &nbsp;&nbsp;&nbsp;&nbsp; $fechaactual$ -- sera sustituida 
        por la fecha del dia actual<br> &nbsp;&nbsp;&nbsp;&nbsp; $fechaasiento$ 
        -- la fecha del asiento.<br> <br>
        Puede, al mismo tiempo que crear todo el asiento, crear entradas en el 
        registro de IVA de forma autom&aacute;tica. Para ello dispone de la pesta&ntilde;a 
        adicional Registro IVA.<br> <br> <br> 
    
<hr>

<br>
	
	
    <br>
      <br>
      <div ><span class="titular"><img src="imgbotones/boton_mayor.gif" width="24" height="24"> 
          LIBRO MAYOR</span></div>
      
    
    <br>
      <br>
      <div >Muestra el LIBRO MAYOR y
permite la posibilidad de listar los apuntes de las cuentas y
subcuentas existentes en
la base de datos del programa.<br>
      <br>
      <div style="text-align: center;"><font size="1"
 face="Verdana, Arial, Helvetica, sans-serif"><img
 src="imgmanual/extracto.png" title=""
 alt="extracto de cuentas" style="width: 920px; height: 484px;"><br>
      </div>
      </div>
      
    
    <br>
      <br>
      <div ></div>
En el extracto hay cuatro pa&#341;ametros b&aacute;sicos que lo delimitan:<br>
      <br>
      <span style="color: rgb(51, 51, 255);">Cuenta Inicial</span>: La
cuenta inicial a partir de la que se quiere empezar el extracto<br>
      <span style="color: rgb(51, 51, 255);">Cuenta Final:</span> La
cuenta final que a partir de la que no se quieren mostrar m&aacute;s
detalles del extracto.<br>
      <span style="color: rgb(51, 51, 255);">Fecha Inicial:</span>
Fecha inicial de los apuntes a mostrar<br>
      <span style="color: rgb(51, 51, 255);">Fecha Final:</span> Fecha
final a partir de la cual no mostrar m&aacute;s apuntes.<br>
      <br>
      
    
    <br>
      Una vez introducidos los cuatro
datos b&aacute;sicos el extracto nos mostrar&aacute; los apuntes
referentes a cada una de las cuentas referenciadas entre las fechas
introducidas. Podemos navegar entre las cuentas mediante los botones de
navegaci&oacute;n de la toolbar, accediendo a la cuenta siguiente, la
cuenta anterior, la primera y la &uacute;ltima cuenta. <br>
      <br>
Si queremos refrescar la informaci&oacute;n disponemos del boton
acutalizar #boton actualizar#<br>
      <br>
Para cada cuenta el extracto nos muestra primero una informaci&oacute;n
preliminar como es el c&oacute;digo de la cuenta, su nombre, y el debe,
haber y saldo que tiene dicha cuenta antes de la fecha inicial.<br>
      <br>
Luego, en forma de tabla, se nos presentan los diferentes apuntes
introducidos en la contabilidad durante el periodo seleccionado y
ordenados por fecha de apunte.<br>
      <br>
Al final aparecen el debe, haber y saldo de la cuenta a fecha final.<br>
      <br>
Los campos que aparecen son fecha, num asiento, descripcion,
contrapartida, debe, haber, saldo, centro de coste y canal. En su
versi&oacute;n del programa puede que no aparezcan todos los campos ya
que los campos a visualizar son configurables mediante el archivo
bulmages.conf (ver secci&oacute;n bulmages.conf).<br>
      
    
    <br>
    <img src="imgbotones/boton_imprimir.gif" width="24" height="24"><span class="subtitular1">IMPRESION&nbsp; 
      DE EXTRACTOS</span>
    
    <br>
      Puede que usted quiera una copia
impresa de su estracto. En ese caso tiene el bot&oacute;n #boton
imprimir# que hara que aparezca el siguiente dialogo pidiendole las
opciones de impresi&oacute;n.<br>
      <div style="text-align: center;"><img
 src="imgmanual/imprimirextracto.png" title=""
 alt="imprimir extracto" style="width: 608px; height: 246px;"><br>
      <div style="text-align: left;">Los campos apareceran rellenos con
los datos que tiene puestos en pantalla, con lo que solo tendr&aacute;
que elegir el formato y darle al bot&oacute;n imprimir.<br>
Bulmag&eacute;s abrir&aacute; un editor de textos o un navegador con el
extracto visualizandose.<br>
      </div>
      </div>
      
    
    <br>
      <span class="subtitular1" style="vertical-align: top;">PUNTEO Y CASACION</span>
    
    <br>
      Sobre el extracto, puede
interesarle ir punteando los apuntes para comprobar con un extracto
bancario la correcci&oacute;n de los mismos.<br>
Para hacer dicha operaci&oacute;n dispone en el extracto de casillas de
verificaci&oacute;n sobre las que puede pulsar para poner o quitar el
punteo. El punteo se guarda autom&aacute;ticamente en la base de datos,
con lo que si cambia de ventana no perder&aacute; el punteo.<br>
      <br>
Bulmag&eacute;s tambien le ofrece la funci&oacute;n de guardar el
punteo en un momento determinado para poder recuperarlo m&aacute;s
adelante si le es preciso. En la ventana del extracto dispone del
bot&oacute;n #boton guardar punteo# que le preguntar&aacute; el nombre
de archivo y la localizaci&oacute;n del mismo en el que guardar el
punteo.<br>
      <br>
M&aacute;s adelante si quiere recuperar el punteo guardado con
anterioridad dispone del bot&oacute;n #boton recuperar punteo# que le
pedira a partir de que archivo recuperar el punteo.<br>
      <br>
Usted puede tener varios punteos almacenados en el sistema y
recuperarlos cuantas veces desee.<br>
      <br>
      <span style="font-weight: bold;">NOTA:</span> Si tras guardar el
punteo ha realizado alguna modificaci&oacute;n de apuntes, o
inserci&oacute;n de nuevos asientos contables puede que el resultado de
recuperar el punteo no sea correcto para los apuntes modificados o para
los nuevos apuntes insertados.<br>
      <br>
En bulmag&eacute;s existe tambi&eacute;n la opci&oacute;n de puntear
directamente los apuntes que tienen un par identico, esto es, que&nbsp;
existe un apunte con un importe en el debe y otro apunte en la misma
cuenta con un importe identico en el haber. Eso es as&iacute; porque
dicho tipo de apuntes suelen corresponder con una misma
transacci&oacute;n econ&oacute;mica que ya ha sido terminada y que ha
dejado el saldo de la cuenta igual que estaba. Para ello tiene el boton
de casaci&oacute;n #boton de casaci&oacute;n#, al pulsar dicho
bot&oacute;n directamente se puntear&aacute;n todos los pares de
apuntes con importes reciprocos en el extracto de la cuenta que este
visualizando.<br>
      
    
    <br>
<span class="subtitular1"><img src="imgbotones/boton_filtrar.gif" width="24" height="24">FILTRADO 
DEL EXTRACTO </span> <br>
     Puede ocurrir que le sea
m&aacute;s c&oacute;modo trabajar si el sistema omite determinados
apuntes sobre los que usted no tiene inter&eacute;s. Para ello tiene el
boton
de filtrado que le permite seleccionar las caracter&iacute;sticas que
deben cumplir aquellos apuntes que desea ver.<br>
      <br>
      <div style="text-align: center;"><img
 src="imgmanual/filtroextracto.png" title=""
 alt="filtrado en el extracto." style="width: 584px; height: 310px;"><br>
      </div>
      
    
	
	<hr>
	
	<br>
    <br>
      <br>
      <div ><span class="head1"><img src="imgbotones/boton_diario.gif" width="25" height="23">&nbsp;</span><span class="titular">LIBRO 
        DIARIO</span></div>
      
    
      <span style="vertical-align: top;"><img
 src="imgmanual/diario.png" title=""
 alt="libro diario" style="width: 993px; height: 427px;"><br>
      
    
    <br>
      El diario tiene dos parametros
b&aacute;sicos que lo delimitan<br>
      <br>
      <span style="color: rgb(51, 51, 255);">Fecha Inicial:</span>
Fecha inicial de los apuntes a mostrar<br>
      <span style="color: rgb(51, 51, 255);">Fecha Final:</span> Fecha
final a partir de la cual no mostrar m&aacute;s apuntes.<br>
      <br>
El libro diario nos muestra todos los apuntes introducidos por orden
cronologico.<br>
      <br>
Con el boton derecho del raton podra ver <br>
      
    
    <br>
      
    <img src="imgbotones/boton_filtrar.gif" width="24" height="24"><span class="subtitular1">FILTRADO 
      DEL DIARIO</span>
    
    <br>
      Puede que Vd. desee ver en el diario s&oacute;lo 
        los apuntes que cumplan determinadas caracteristicas. Para ello tiene 
        la opcion de filtrado con el boton <img src="imgbotones/boton_filtrar.gif" width="24" height="24"><br>
      <div style="text-align: center;"><img
 src="imgmanual/FILTROdiario.png" title=""
 alt="filtro diario" style="width: 584px; height: 310px;"><br>
      </div>
      
    
    <br>
      <span class="subtitular1" style="vertical-align: top;"><img src="imgbotones/boton_imprimir.gif" width="24" height="24">IMPRESION 
        DEL DIARIO</span>
    
	<br>
      <center><img
 src="imgmanual/printdiario.png" title=""
 alt="imprimir diario" style="width: 608px; height: 233px;"></center><br>
      
    

<HR>

<br>
    <br>
      
    <span style="vertical-align: top;" class="titular"><img src="imgbotones/boton_balance.gif" width="24" height="24"> 
      <img src="imgbotones/boton_balancetree.gif" width="24" height="24">BALANCE 
      DE CUENTAS</span>
    
	<br>
	<span class="subtitular1"> BALANCE DE CUENTAS</span>
  
      <span style="vertical-align: top;"><img
 src="imgmanual/balance.png" title=""
 alt="balance de cuentas" style="width: 908px; height: 366px;"><br>
      
    
    <br>
      
    <span style="vertical-align: top;"><big><span
 style="color: rgb(0, 0, 153); font-weight: bold;"><img src="imgbotones/boton_balancetree.gif" width="24" height="24"><span class="subtitular1">BALANCE 
      JERARQUICO DE CUENTAS</span></span></big><br>
      
    
      <span style="vertical-align: top;"><img
 src="imgmanual/balancejerarquico.png"
 title="" alt="balance jerarquico" style="width: 908px; height: 366px;"><br>
      
    
    <br>
<span style="vertical-align: top;"><big><span
 style="color: rgb(0, 0, 153); font-weight: bold;"><img src="imgbotones/boton_imprimir.gif" width="24" height="24"><span class="subtitular1">IMPRESION 
DE BALANCE</span></span></big><br>
<br>
Puede obtener una copia impresa del balance (en cualquiera de sus dos modalidades) 
dandole al boton <img src="imgbotones/boton_imprimir.gif" width="24" height="24">, 
inmediantamente aparecer&aacute; la ventana de impresi&oacute;n de balance.<br>
En esta ventana puede elegir las opciones del listado, tambi&eacute;n puede elegir 
el formato deseado para el mismo. Cuando pulse el boton imprimir se abrira el 
programa visor del listado y se lo presentar&aacute;.<br>
<img
 src="imgmanual/balanceprint.png" title=""
 alt="impresion de balance" style="width: 608px; height: 364px;"><br>

<HR>
<br>
<br>
<div ><span class="titular">ESTADISTICAS </span></div>
<br>
<span class="subtitular1">SEGUIMIENTO DE CUENTAS</span> <br>
Mediante la opci&oacute;n estadisticas/seguimiento de cuentas del menu de la aplicaci&oacute;n 
puede acceder a una pantalla que le permite seguir de forma gr&aacute;fica la 
progresi&oacute;n de las cuentas de su empresa. Mediante esta pantalla puede seguir 
el saldo, los movimientos y las principales contrapartidas que intervienen con 
la cuenta introducida. Puede llegar a comparar hasta tres cuentas diferentes.<br> 
<br>
<img
 src="imgmanual/estadisticas1.png" title=""
 alt="Estadisticas" style="width: 945px; height: 450px;"><br>
<br>
<img
 src="imgmanual/estadisticas2.png" title=""
 alt="estadisticas" style="width: 945px; height: 450px;"><br>
<br>
<br>
<br>
<div ><span class="subtitular1">BALANCE GR&Aacute;FICO</span></div>
<br>
Mediante esta opci&oacute;n puede obtener informaci&oacute;n gr&aacute;fica sobre 
el balance de cuentas. Mediante el diagrama de tarta del balance puede ver que 
cuentas tienen mayor relevancia en su contabilidad. Lo que muestra el balance 
gr&aacute;fico es el saldo de las cuentas de nivel 2.<br>
<br>
<img
 src="imgmanual/bgrafico.png" title=""
 alt="balance gr&aacute;fico" style="width: 768px; height: 438px;"><br>

<HR>
<br>
<span class="titular">OTRAS OPCIONES</span>  <br>
<br>
<div ><font size="1"
 face="Verdana, Arial, Helvetica, sans-serif">Permite posicionar las ventanas 
  abiertas en el programa en diferentes posiciones predefinidas.</font></div> 
<br>
<br>
<div ><span class="head1"><font color="#663333"
 size="1" face="Verdana, Arial, Helvetica, sans-serif">3.2.7.1</font><font
 size="1" face="Verdana, Arial, Helvetica, sans-serif"> NEW WINDOW</font></span><font
 size="1" face="Verdana, Arial, Helvetica, sans-serif"><a name="3271"></a></font></div> 
<br>
<br>
<div ><span class="head1"><font color="#663333"
 size="1" face="Verdana, Arial, Helvetica, sans-serif">3.2.7.2</font><font
 size="1" face="Verdana, Arial, Helvetica, sans-serif"> CASCADE</font></span><font
 size="1" face="Verdana, Arial, Helvetica, sans-serif"><a name="3272"></a></font></div> 
<br>
<br>
<div ><font size="1"
 face="Verdana, Arial, Helvetica, sans-serif">Muestra todas las ventanas existentes 
  en ese momento una tras otra en el orden en que han sido abiertas.</font></div> 
<br>
<br>
<div ><span class="head1"><font color="#663333"
 size="1" face="Verdana, Arial, Helvetica, sans-serif">3.2.7.3</font><font
 size="1" face="Verdana, Arial, Helvetica, sans-serif"> TITLE</font></span><font
 size="1" face="Verdana, Arial, Helvetica, sans-serif"><a name="3273"></a></font></div> 
<br>
<br>
<div ><font size="1"
 face="Verdana, Arial, Helvetica, sans-serif">Muestra todas las ventanas abiertas 
  ocupando el m&aacute;ximo espacio de la pantalla total.</font></div>
<br>
<br>
<div ><span class="head1"><font color="#663333"
 size="1" face="Verdana, Arial, Helvetica, sans-serif">3.2.7.4</font><font
 size="1" face="Verdana, Arial, Helvetica, sans-serif"> OTRAS OPCIONES</font></span><font
 size="1" face="Verdana, Arial, Helvetica, sans-serif"><a name="3274"></a></font></div> 
<br>
<br>
<div ><font size="1"
 face="Verdana, Arial, Helvetica, sans-serif">Permite alternar entre las ventanas 
  abiertas en ese momento sin necesidad de mostrarlas todas o de minimizarlas 
  o maximizarlas.</font></div>
<br>
<br>
<div ><span class="head1">3.2.8 EL MEN&Uacute; VER</span><a
 name="328"></a></div>
<br>
<br>
<div ><span class="head1">3.2.8.1 TOOLBAR</span><font
 size="1" face="Verdana, Arial, Helvetica, sans-serif"><a name="3281"></a></font></div> 
<br>
<br>
<div >Muestra u oculta la barra de herramientas del programa seg&uacute;n est&eacute; 
  o no seleccionada esta opci&oacute;n.</div>
<br>
<br>
<div ><font size="1"
 face="Verdana, Arial, Helvetica, sans-serif"> <span class="head1"><font
 color="#663333">3.2.8.2</font> STATUSBAR</span><a name="3282"></a></font></div> 
<br>
<br>
<div >Muestra u oculta la barra de estatus del programa seg&uacute;n est&eacute; 
  o no seleccionada esta opci&oacute;n.</div>
<br>
<br>
</span>
<div class="subtitular1" >EL MEN&Uacute; AYUDA</div>
<span style="vertical-align: top;"> <br>
<br>
<span class="subtitular1"> ACERCA DE  </span><br>
<br>
<div >Muestra la informaci&oacute;n del programa: la versi&oacute;n, los autores 
  y colaboradores y las empresas o entidades que proporcionan o han proporcionado 
  soporte al programa as&iacute; como algunas direcciones de inter&eacute;s.<br>
  Para m&aacute;s informaci&oacute;n sobre el programa consulte la web oficial:<br>
  http://bulmages.bitassa.net/community<br>
  O escriba al e-mail de alguno de los autores.</div>
<br>
<br>
<span class="subtitular1">QU&Eacute; ES ??</span></span><br> 
      <br> <div >Le permite consultar la descripci&oacute;n 
          de los iconos del programa.</div>
    
    <br> 
      <br> 
<div ><span class="subtitular1"> EL MEN&Uacute; SALIR</span></div>
    
    <br> 
      <br> 
<div ><span class="subtitular1"> EXIT</span></div>
    
    <br> 
      <br> <div ><font size="1"
 face="Verdana, Arial, Helvetica, sans-serif">Cierra las ventanas activas en el 
          programa y le permite terminar la ejecuci&oacute;n de BulmaG&eacute;s.</font></div>
    

	
	<HR>
	<br>
    <br>
      
    <span class="titular" style="vertical-align: top;"><strong><font color="#0000FF" size="5">EL 
      ARCHIVO DE CONFIGURACION BULMAGES.CONF</font></strong> </span>
    
    <br>
      <p>Mediante este archivo, usted puede especificar 
          determinados par&aacute;metros que afectan al comportamiento del programa.<br>
          El archivo se compone de l&iacute;neas con dos palabras. La primera 
          palabra indica la car&aacute;ter&iacute;stica a la que se desea dar 
          valor y la segunda palabra indica el valor que toma dicha caracter&iacute;stica.<br>
          <br>
          A continuaci&oacute;n detallamos todas las variables que se pueden configurar, 
          como afectan al programa y los posibles valores que pueden tener.<br>
          <br>
          # Estos valores indican el fondo y la fuente de la ventana de apuntes.<br>
          <span style="color: rgb(51, 51, 255);"><br>
          CONF_BG_APUNTES</span>: Esta opci&oacute;n indica el color de fondo 
          de la ventana de introducci&oacute;n de apuntes cuando el asiento esta 
          cerrado. Como valor coge un color en formato RGB (#RRGGBB)<br>
          <br>
          <span style="color: rgb(51, 51, 255);">CONF_FG_APUNTES: <span
 style="color: rgb(0, 0, 0);">Esta opci&oacute;n indica el color de texto de la 
          ventana de introducci&oacute;n de apuntes cuando el asiento esta cerrado. 
          Como valor coge un color en formato RGB.<br>
          <br>
          </span>CONF_BG_APUNTESA</span> : Esta opci&oacute;n indica el color 
          de fondo de la ventana de introducci&oacute;n de apuntes cuando el asiento 
          est&aacute; abierto. Como valor coge un color en formato RGB.<br>
          <br>
          <span style="color: rgb(51, 51, 255);">CONF_FG_APUNTESA</span> : Esta 
          opci&oacute;n indica el color de texto de la ventana de introducci&oacute;n 
          de apuntes cuando el asiento est&aacute; abierto. Como valor coge un 
          color en formato RGB.<br>
          <br>
          <span style="color: rgb(51, 51, 255);">CONF_FONTSIZE_APUNTES</span> 
          : Esta opci&oacute;n indica el tama&ntilde;o de la fuente de la pantalla 
          de apuntes. Como valor coge un numero entero positivo indicando el tama&ntilde;o 
          de la fuente. <br>
          <br>
          <span style="color: rgb(51, 51, 255);">CONF_FONTFAMILY_APUNTES</span> 
          : Esta opci&oacute;n indica la tipograf&iacute;a de la fuente de la 
          pantalla de apuntes. Como valor coge un nombre de fuente p.ej: courier, 
          airal, times new roman, helvetica, verdana.<br>
          <br style="color: rgb(51, 51, 255);">
          <span style="color: rgb(51, 51, 255);">CONF_CONTRAPARTIDA_APUNTES</span>&nbsp; 
          : Esta opci&oacute;n indica si en la pantalla de introducci&oacute;n 
          de apuntes debe aparecer la columna de contrapartida. Si desea que aparezca 
          la contrapartida en la pantalla de introducci&oacute;n de aputnes ponga 
          el valor&nbsp; YES en esta opci&oacute;n, en caso contrario ponga el 
          valor NO.<br>
          <br>
          <span style="color: rgb(51, 51, 255);">CONF_CANAL_APUNTES</span>&nbsp;&nbsp; 
          : Esta opci&oacute;n indica si en la pantalla de introducci&oacute;n 
          de apuntes debe aparecer la columna del canal. Los valores que puede 
          coger son YES y NO.<br>
          <br>
          <span style="color: rgb(51, 51, 255);">CONF_CCOSTE_APUNTES</span>&nbsp;&nbsp; 
          : Esta opci&oacute;n indica si en la pantalla de introducci&oacute;n 
          de apuntes debe aparecer la columna de centro de coste. Los valores 
          que puede coger son YES y NO.<br>
          <br>
          <span style="color: rgb(51, 51, 255);">CONF_CONTRAPARTIDA_EXTRACTO</span> 
          : Esta opci&oacute;n indica si en la ventana de extracto debe aparecer 
          el campo de contrapartida, esta opci&oacute;n puede coger valores YES 
          y NO.<br>
          <br>
          <span style="color: rgb(51, 51, 255);">CONF_CANAL_EXTRACTO</span>&nbsp; 
          : Esta opci&oacute;n indica si en la ventana de extracto debe aparecer 
          el campo de canal. Esta opci&oacute;n puede coger valores YES y NO<br>
          <br style="color: rgb(51, 51, 255);">
          <span style="color: rgb(51, 51, 255);">CONF_CCOSTE_EXTRACTO</span>&nbsp;&nbsp; 
          : Esta opci&oacute;n indica si en la ventana de extracto debe aparecer 
          el campo de centro de coste. Esta opci&oacute;n puede coger valores 
          YES y NO.<br>
          <br>
          <span style="color: rgb(51, 51, 255);">CONF_CONTRAPARTIDA_DIARIO</span>&nbsp; 
          : Esta opci&oacute;n le permite mostrar la columna de contrapartida 
          en el libro diario del programa. Esta opci&oacute;n puede coger valores 
          YES o NO.<br>
          <br>
          <span style="color: rgb(51, 51, 255);">CONF_CANAL_DIARIO</span>&nbsp;&nbsp; 
          : Esta opci&oacute;n le permite mostrar la columna de canal en el libro 
          diario del programa. Esta opci&oacute;n puede coger valores YES o NO.<br>
          <br>
          <span style="color: rgb(51, 51, 255);">CONF_CCOSTE_DIARIO</span>&nbsp;&nbsp; 
          : Esta opci&oacute;n le permite mostrar la columna de centro de coste 
          en el libro diario del programa. Esta opci&oacute;n puede coger valores 
          YES o NO.<br>
          <br>
          <br>
          # Estos valores indican el fondo de la ventan del diario<br>
        <font color="#0000FF">CONF_BG_DIARIO</font>&nbsp;&nbsp; #66CCCC<br>
        <font color="#0000FF">CONF_FONTSIZE_DIARIO</font>&nbsp; 12<br>
        <font color="#0000FF">CONF_FONTFAMILY_DIARIO</font>&nbsp; Arial<br>
        <font color="#0000FF">CONF_FG_DIARIO1</font>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
        #CC0000<br>
        <font color="#0000FF">CONF_FG_DIARIO2</font>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
        #000000<br>
          <br>
          # Parametros de configuracion de la ventana de Extracto<br>
        <font color="#0000FF">CONF_BG_EXTRACTO</font> #0099CC<br>
          <br>
          # Parametros de configuracion de las ventanas de Balance<br>
        <font color="#0000FF">CONF_BG_BALANCE</font>&nbsp; #FFCC99<br>
        <font color="#0000FF">CONF_BG_BALANCETREE</font> #CCCC66<br>
          <br>
          #Parametros de configuracion del splash y del fondo del area de trabajo<br>
        <font color="#0000FF">CONF_BACKGROUND</font> /usr/share/bulmages/backgrounds/universo.jpg</p>
        <p><br>
          <font color="#0000FF">CONF_SPLASH</font>&nbsp;: Esta opci&oacute;n indica 
          la ruta del archivo de imagen del splash. P. ej: /usr/share/bulmages/nousplash1.jpg<br>
          <br>
          # Parametros de configuracion de la base de datos.<br>
          <span style="color: rgb(51, 51, 255);">CONF_METABASE</span>&nbsp; : 
          Esta opci&oacute;n le permite&nbsp; especificar cual ser&aacute; la 
          base de datos metabd del sistema. Por defecto el nombre de base de datos 
          meta es metabd, bajo determinadas circunstancias&nbsp; a Vd puede interesarle 
          que la base de datos meta tenga un nombre diferente. Escriba aqui el 
          nombre de dicha base de datos.<br>
          <br>
          <span style="color: rgb(51, 51, 255);">CONF_SERVIDOR</span>&nbsp;&nbsp; 
          : Mediante esta opci&oacute;n puede indicar cual ser&aacute; el servidor 
          de bases de datos al que atacar&aacute; el programa. Por defecto esta 
          opci&oacute;n esta en localhost. Pero si le interesa que las bases de 
          datos est&eacute;n en un ordenador diferente puede especificar la IP 
          de dicho ordenador mediate esta opcion.<br>
          <br>
          <span style="color: rgb(51, 51, 255);">CONF_PUERTO</span>&nbsp; : Mediante 
          esta opcion puede indicar en que puerto del ordenador se encuentra alojado 
          el servidor de base de datos postgresql, por defecto suele ser el 5432<br>
          <br>
          # Parametros de configuracion de programas<br>
          <font color="#0000FF">CONF_EDITOR</font>&nbsp;: Esta opci&oacute;n indica 
          cual es el editor de textos que se va a utilizar para mostrar los listados. 
          p ej: kedit<br>
        </p>
        

</body>
</html>
