Repository: eboladev/Bulmages-1
Catalog: bulmages/bulmatpv/src/po/bulmatpv_*.po
Languages: fr_fr

source: &Acerca de
fr_fr: &A propos de

source: &Cerrar
fr_fr: &Fermer

source: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:10pt; font-weight:400; font-style:normal;"> <p style="-qt-paragraph-type:empty; margin-top:12px; margin-bottom:12px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px; font-size:9pt;"></p></body></html>
fr_fr: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:112pt; font-weight:4120; font-style:normal;"> <p style="-qt-paragraph-type:empty; margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"></p></body></html>

source: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:9pt; font-weight:600; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Terminal Punto de Venta GPL - Version 0.13.0 -</p></body></html>
fr_fr: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:9pt; font-weight:600; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Terminal Point de VenteGPL - Version 0.13.0 -</p></body></html>

source: A&utores
fr_fr: A&uteurs

source: Acerca de BulmaTPV
fr_fr: A propos de BulmaTPV

source: Acuerdo de &licencia
fr_fr: Accord de &licence

source: Administrador
fr_fr: Administrateur

source: Almacen
fr_fr: Magasin

source: Anyadir
fr_fr: Ajouter

source: Bloqueado
fr_fr: Bloqué

source: Borrar
fr_fr: Effacer

source: Cantidad
fr_fr: Quantité

source: Cargando plugins
fr_fr: Charger le greffon

source: Cerrar
fr_fr: Fermer

source: Cliente
fr_fr: Client

source: Codigo articulo
fr_fr: Code de l'article

source: Compilado usando la version de QT:
fr_fr: Compiler avec la version QT :

source: Descripcion
fr_fr: Description

source: Descuento
fr_fr: Remise

source: El ticket esta vacio.
fr_fr: Le ticket est vide

source: Error inesperado en BulmaTPV. El programa se cerrara.
fr_fr: Erreur inattendu dans BulmaTPV. Le programme se fermera.

source: Estadisticas
fr_fr: Statistiques

source: Hora
fr_fr: Heure

source: IVA
fr_fr: TVA

source: Id albaran
fr_fr: Id bulletin

source: Id articulo
fr_fr: Id article

source: Id fechaalbaran
fr_fr: Id date de bulletin

source: Id forma de pago
fr_fr: Id Forme de paiement

source: Id linea albaran
fr_fr: Id ligne de bulletin

source: Identificacion
fr_fr: Identification

source: Iglues/BtBulmaTPV
fr_fr: Iglues/BulmaTPV

source: Inicializando componentes
fr_fr: Initier les composants

source: Inicializando listado de articulos
fr_fr: Initier la liste d'articles

source: Iniciando clases
fr_fr: Initier les classes

source: Lanzando plugins
fr_fr: Lancer les greffons

source: Leyendo configuracion
fr_fr: Lire la configuration

source: Modificar
fr_fr: Modifier

source: Nombre
fr_fr: Nom

source: Nombre articulo
fr_fr: Nom de l'article

source: Num
fr_fr: Numéro

source: Orden
fr_fr: Ordre

source: Pendiente
fr_fr: En suspens

source: Precio
fr_fr: Prix

source: Preferencias
fr_fr: Préference

source: Referencia
fr_fr: Référence

source: Sobre BtBulmaTPV
fr_fr: Sur BulmaTPV

source: Sobre Bulmages
fr_fr: Sur BulmaTPV

source: Sobre Qt
fr_fr: Sur Qt

source: Sopor&te
fr_fr: Suppor&t

source: Terminado
fr_fr: Fini

source: Terminal Punto de Venta GPL
fr_fr: Terminal Point de Vente GPL

source: Ticket actual
fr_fr: Ticket actuel

source: Trabajador
fr_fr: Salarié

source: Ventana &Completa
fr_fr: Plein é&cran

source: Ventana Completa
fr_fr: Plein écran
