Repository: eboladev/Bulmages-1
Catalog: bulmages/bulmafact/plugins/pluginbf_canalyccoste/po/pluginbf_canalyccoste_*.po
Languages: fr_fr

source: &Balance jerarquico
fr_fr: &Balance

source: &Cancelar
fr_fr: &Annuler

source: &Texto Plano
fr_fr: &Texte plat

source: &Ver
fr_fr: &Afficher

source: &texto plano
fr_fr: &Texte plat

source: Acep&tar
fr_fr: &Accepter

source: Actualizar canalyccoste
fr_fr: Actualiser la canalyccoste

source: Ajustar altura
fr_fr: Ajuster la hauteur

source: Ajustar alturas
fr_fr: Ajuster la hauteur

source: Ajustar columa
fr_fr: Ajuster la colonne

source: Ajustar columnas
fr_fr: Ajuster les colonnes

source: Balance de cuentas
fr_fr: Balance de comptes

source: Balance jerarquico
fr_fr: Balance hiérarchique

source: Balance jerarquico de Cuentas
fr_fr: Balance hiérarchique de comptes

source: Borrar albaran
fr_fr: Effacer le bulletin

source: Borrar registro
fr_fr: Effacer le registre

source: Centro de coste:
fr_fr: Centre de finance :

source: Codigo
fr_fr: Code

source: Codigo final
fr_fr: Code final

source: Codigo inicial
fr_fr: Code initial

source: Configurar
fr_fr: Configurer

source: Cuenta final:
fr_fr: Compte final :

source: Cuenta inicial:
fr_fr: Compte initial :

source: Datos del listado:
fr_fr: Données de la liste :

source: Debe
fr_fr: Débit

source: Debe
fr_fr: Débit

source: Debe:
fr_fr: Débit :

source: Denominacion
fr_fr: Dénomination

source: Fecha final
fr_fr: Date finale

source: Fecha final:
fr_fr: Date finale :

source: Fecha inicial
fr_fr: Date initiale

source: Fecha inicial:
fr_fr: Date initiale :

source: Filtrar canalyccoste
fr_fr: Filtrer la canalyccoste

source: Formato
fr_fr: Formater

source: Formato:
fr_fr: Formater :

source: GroupBox
fr_fr: Groupe de boite

source: Haber
fr_fr: Crédit

source: Haber
fr_fr: Crédit

source: Haber:
fr_fr: Crédit :

source: Id cuenta
fr_fr: Id compte

source: Impresion del canalyccoste de sumas y saldos
fr_fr: Impression de la canalyccoste des sommes et des soldes

source: Imprimir albaran
fr_fr: Imprimer le bulletin

source: Imprimir canalyccoste
fr_fr: Imprimer la canalyccoste

source: Incl&uir resultados parciales
fr_fr: Inclure les résultats partiaux

source: Incluir &niveles superiores.
fr_fr: Inclure les niveaux supérieures

source: Nivel de Cuentas
fr_fr: Niveau des comptes

source: Nivel:
fr_fr: Niveau :

source: Permite realizar canalyccostes
fr_fr: Impression des Balances

source: Podra disponer de la informacion del canalyccoste
fr_fr: Disponibilité de l'information de la canalyccoste

source: Propietario
fr_fr: Propriétaire

source: Saldo
fr_fr: Solde

source: Saldo
fr_fr: Solde

source: Saldo anterior
fr_fr: Solde précédent

source: Saldo anterior:
fr_fr: Solde précédent :

source: Saldo:
fr_fr: Solde :

source: Tipo cuenta
fr_fr: Type compte

source: Total Debe:
fr_fr: Débit total :

source: Total Haber:
fr_fr: Crédit total :

source: Ver configurador de subformulario
fr_fr: Afficher la configuration de sous formulaire
