Repository: eboladev/Bulmages-1
Catalog: bulmages/bulmafact/plugins/pluginbf_z2z/po/pluginbf_z2z_*.po
Languages: fr_fr

source: &Aceptar
fr_fr: &Accepter

source: &Cancelar
fr_fr: &Annuler

source: &Detalle
fr_fr: &Détail

source: &Herramientas
fr_fr: &Outils

source: Borrar factura
fr_fr: Effacer la Facture

source: Error al crear la factura
fr_fr: Erreur à la création de la facture

source: Error en el traspaso
fr_fr: Erreur dans la cession

source: Excluir Articulo
fr_fr: Exclure l'article

source: Excluir Familias
fr_fr: Exclure la famille

source: Guardar factura
fr_fr: Sauvegarder la Facture

source: Imprimir factura
fr_fr: Imprimer la facture

source: Lista vacia
fr_fr: Liste vide

source: No cambiar precios de articulos
fr_fr: Ne pas changer le prix des articles

source: Num Minimo lineas ticket
fr_fr: N° minimum de ligne ticket

source: Opciones
fr_fr: Options

source: Referencias
fr_fr: Références

source: Total Tickets
fr_fr: Tickets Totaux

source: Total Traspasable
fr_fr: Total cession

source: Total aprox a Traspasar
fr_fr: Total approx cession

source: Traspasar
fr_fr: Cession

source: Traspaso de Z
fr_fr: Cession de Z
