Repository: eboladev/Bulmages-1
Catalog: bulmages/bulmafact/plugins/pluginbf_cuenta/po/pluginbf_cuenta_*.po
Languages: fr_fr

source: &Aceptar
fr_fr: &Accepter

source: &Anterior
fr_fr: &Précédent

source: &Cancelar
fr_fr: &Annuler

source: &Cuentas Contables
fr_fr: &Comptes

source: &Datos contables
fr_fr: &Données comptables

source: &Gasto
fr_fr: &Dépense

source: &Imputacion
fr_fr: &Imputation

source: &Ingreso
fr_fr: &Recette

source: &Neto
fr_fr: &Net

source: &Otros datos
fr_fr: &Autres données

source: &Pasivo
fr_fr: &Passif

source: &Plan Contable
fr_fr: &Plan Comptable

source: &Siguiente
fr_fr: &Suivant

source: A&ctivo
fr_fr: A&ctif

source: Actualizar listado
fr_fr: Actualiser la liste

source: Articulos
fr_fr: Articles

source: Banco de la cuenta
fr_fr: Banque du compte

source: Bloqueada
fr_fr: Bloquer

source: Borrar articulo
fr_fr: Effacer l'article

source: Borrar cuenta
fr_fr: Effacer le compte

source: Buscar:
fr_fr: Chercher :

source: Busqueda:
fr_fr: Recherche :

source: C. Coste por Defecto
fr_fr: Centre de finance par défaut

source: CIF de la cuenta
fr_fr: CIF du compte

source: CODIGO
fr_fr: Code

source: CP de la cuenta
fr_fr: CP du compte

source: Cargar Asiento
fr_fr: Charger l'assiette

source: Centro de coste por defecto
fr_fr: Centre de finance par défaut

source: Codigo Cuenta
fr_fr: Code de compte

source: Codigo cuenta
fr_fr: Code de compte

source: Codigo cuenta corriente.:
fr_fr: Code de compte courant :

source: Codigo:
fr_fr: Code :

source: Comentarios de la cuenta
fr_fr: Libellé du compte

source: Comentarios:
fr_fr: Libellés :

source: Configurar listado
fr_fr: Configurer la liste

source: Correo electronico:
fr_fr: Courriel :

source: Cuenta
fr_fr: Compte

source: Cuenta Padre:
fr_fr: Compte père :

source: Datos de la cuenta:
fr_fr: Données du compte :

source: Debe
fr_fr: Débit

source: Debe seleccionar una cuenta
fr_fr: Vous devez sélectionner un compte

source: Debe:
fr_fr: Débit :

source: Descripcion
fr_fr: Description

source: Direccion de la cuenta
fr_fr: Direction du compte

source: Direccion:
fr_fr: Direction :

source: Duplicar Asiento
fr_fr: Dupliquer l'assiette

source: E-Mail de la cuenta
fr_fr: Courriel du compte

source: Editar articulo
fr_fr: Editer l'article

source: Editar cuenta
fr_fr: Editer le compte

source: Elija el archivo
fr_fr: Choisir un fichier

source: Entidad de la cuenta
fr_fr: Entité du compte

source: Exportar cuentas
fr_fr: Exporter les comptes

source: Filtrar listado
fr_fr: Filtrer la liste

source: Grupo
fr_fr: Groupe

source: Guardar cuenta
fr_fr: Sauvegarder le compte

source: Haber
fr_fr: Crédit

source: Haber:
fr_fr: Crédit :

source: ID cuenta
fr_fr: ID Compte

source: Importar cuentas
fr_fr: Importer les comptes

source: Imprimir cuentas
fr_fr: Imprimer les comptes

source: Imprimir listado
fr_fr: Imprimer la liste

source: Imputacion
fr_fr: Imputation

source: NOMBRE
fr_fr: NOM

source: Nivel minimo
fr_fr: Niveau minimum

source: No Debe
fr_fr: No de Débit

source: No Haber
fr_fr: No de Crédit

source: NoDebe
fr_fr: N. de débit

source: NoHaber
fr_fr: N. de crédit

source: Nodebe
fr_fr: Nodébit

source: Nohaber
fr_fr: Nocrédit

source: Nombre cuenta
fr_fr: Nom de Compte

source: Nombre de la cuenta
fr_fr: Nom de Compte

source: Nombre de la entidad:
fr_fr: Nom de l'organisme :

source: Nombre:
fr_fr: Nom :

source: Nueva cuenta
fr_fr: Nouveau du Compte

source: Opciones de cuenta:
fr_fr: Options du compte:

source: Padre
fr_fr: Principal

source: Permite ver y modificar el plan contable
fr_fr: Modifier le plan comptable

source: Plan &contable
fr_fr: Plan &comptable

source: Plan contable (*.xml)
fr_fr: Plan Comptable (*.xml)

source: Plan de cuentas
fr_fr: Plan comptable

source: Poblacion
fr_fr: Peuple

source: Poblacion:
fr_fr: Ville :

source: Provincia
fr_fr: Province

source: Provincia:
fr_fr: Province :

source: Reg&ularizacion
fr_fr: Rég&ularisation

source: Regularizacion
fr_fr: Régularisation

source: S&ubcuentas
fr_fr: So&us comptes

source: Saldos:
fr_fr: Soldes :

source: Se procedera a borrar la cuenta.
fr_fr: Effacer le compte.

source: Seleccionar cuenta
fr_fr: Sélectionner un compte

source: Selector de articulos
fr_fr: Sélection des articles

source: Sin &Tipo
fr_fr: Sans &type

source: Telefono de la cuenta
fr_fr: Téléphone du compte

source: Telefono:
fr_fr: Téléphonedu compte :

source: Tipo cuenta
fr_fr: Type de compte

source: Tipo de Cuenta
fr_fr: Type de compte

source: Tipo de cuenta:
fr_fr: Type de compte :

source: URL de la pagina web:
fr_fr: Adresse de la page web :

source: Web de la cuenta
fr_fr: Web du compte
