Repository: eboladev/Bulmages-1
Catalog: bulmages/bulmafact/plugins/pluginbf_correo/po/pluginbf_correo_*.po
Languages: ca_es, fr_fr

source: con fecha
ca_es: amb data
fr_fr: avec daté

source: con referencia
ca_es: amb referència
fr_fr: en référence

source: Adjunto le enviamos el albaran numero
ca_es: Adjunt li enviem l'albarà numero
fr_fr: Rattaché nous envoyer le bordereau de livraison avec numéro

source: Adjunto le enviamos el pedido numero
ca_es: Adjunt li enviem la comanda numero
fr_fr: Rattaché nous envoyer l'ordre avec numéro

source: Adjunto le enviamos el presupuesto numero
ca_es: Adjunt li enviem el pressupost numero
fr_fr: Rattaché nous envoyer le budget avec numéro

source: Adjunto le enviamos la factura numero
ca_es: Adjunt li enviem la factura numero
fr_fr: Rattaché nous envoyer la facture avec numéro

source: Albaran
ca_es: Albarà
fr_fr: Bordereau de livraison

source: Atentamente "
ca_es: Atentament "
fr_fr: Cordialement "

source: Cliente correo.
ca_es: Client de correu.
fr_fr: Client de messagerie.

source: Enviar por e-mail al cliente
ca_es: Enviar per e-mail al client
fr_fr: Envoi par client courriel

source: Factura
fr_fr: Facture

source: Localización
ca_es: Localització
fr_fr: Localisation

source: No se ha encontrado el programa. Por favor, especifique el programa manualmente.
ca_es: No s'ha trobat el programa. Per favor, especifiqui el programa manualment.
fr_fr: Pas trouvé le programme. S'il vous plaît spécifier manuellement le programme.

source: No se ha podido crear la ventana de seleccion
ca_es: No s'ha pogut crear la finestra de selecció
fr_fr: Impossible de créer le fenêtre de sélection

source: Pedido
ca_es: Comanda
fr_fr: Ordre

source: Presupuesto
ca_es: Pressupost
fr_fr: Budget

source: Seleccionar
fr_fr: Sélectionner

source: Seleccione su cliente de correo
ca_es: Seleccioni el seu client de correu
fr_fr: Sélectionnez votre client de messagerie

source: Seleccione, o indique la localización de su cliente de correo electronico
ca_es: Seleccioni, o indiqui la localització del seu client de correu electrònic
fr_fr: Sélectionner, ou indiquer l'emplacement de votre client de messagerie

source: Sin otro particular, reciba un cordial saludo
ca_es: Sense un altre particular, rebi cordials salutacions
fr_fr: Sincèrement vôtre, Cordialement

source: Todos los archivos
ca_es: Tots els arxius
fr_fr: Tous les fichiers
