Repository: eboladev/Bulmages-1
Catalog: bulmages/bulmafact/plugins/pluginbf_sepa20022/po/pluginbf_sepa20022_*.po
Languages: ca_es, fr_fr

source: %3 : %1 recibos, %2 EUR.
ca_es: %3 : %1 rebuts, %2 EUR.
fr_fr: %3 : %1 reçus, %2 EUR.

source: %1 (%2) supera la longitud maxima (%3 caracteres)
ca_es: %1 (%2) supera la longitud màxima (%3 caràcters)
fr_fr: %1 (%2) dépasse la longueur maximum (%3 caracteres)

source: %2 .El fichero de remesa bancaria generado no es aprovechable. Ha fallado la generacion en el recibo con referencia %1
ca_es: %2 .El fitxer de remesa bancària generat no es pot aprofitar. Ha fallat la generació al rebut amb referència %1
fr_fr: %2 .Le fichier de remise bancaire produit n'est pas utilisable. Il a raté la génération du reçu avec référence %1

source: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:9pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Patron del texto que recibiran los clientes de su banco como concepto. El concepto sera el texto introducido aqui sustituyendo los siguientes parametros por su valor para cada factura</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%serie</span> - Serie de la factura</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%num</span> - Numero de facturra</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%id</span> - identificador interno de la factura</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%fechafac[</span><span style=" font-weight:600; font-style:italic;">dd.MM.yyyy</span><span style=" font-weight:600;">]</span> - fecha de factura en algun formato aceptado por postgresql</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%fecharec[</span><span style=" font-weight:600; font-style:italic;">dd.MM.yyyy</span><span style=" font-weight:600;">]</span> - fecha de cargo del recibo en algun formato aceptado por postgresql (puede coincidir o no con la fecha de la factura, segun lo que indique en Fecha de Cargo)</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%desc</span> - Texto de descripcion de la factura</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%ref</span> - referencia de la factura.</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%base</span> - base imponible</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%imp</span> - impuestos</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%total</span> - total con impuestos incluidos</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%coment</span> - comentario de la factura</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%contact</span> - persona de contacto</p> <p style="-qt-paragraph-type:empty; margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"></p></body></html>
ca_es: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:9pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Patró del text que els clients rebran de llurs bancs com a concepte. El concepte serà el text introduït aquí després de substituir els següents paràmetres pel seu valor en cada factura</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%serie</span> - Sèrie de la factura</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%num</span> - Número de facturra</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%id</span> - identificador intern de la factura</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%fechafac[</span><span style=" font-weight:600; font-style:italic;">dd.MM.yyyy</span><span style=" font-weight:600;">]</span> - data de factura en algun format acceptat per postgresql</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%fecharec[</span><span style=" font-weight:600; font-style:italic;">dd.MM.yyyy</span><span style=" font-weight:600;">]</span> - data de càrrec del rebut en algun format acceptat per postgresql (pot coincidir o no amb la data de la factura, segons el que poseu a Data de Càrrec)</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%desc</span> - Text de descripció de la factura</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%ref</span> - referència de la factura.</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%base</span> - base imponible</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%imp</span> - impostos</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%total</span> - total amb els impostos inclosos</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%coment</span> - comentari de la factura</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%contact</span> - persona de contacte</p> <p style="-qt-paragraph-type:empty; margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"></p></body></html>
fr_fr: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:9pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Modèle de texte reçu par les clients de la banque comme raison invoquée. La raison sera le texte introduit ici en remplaçant les paramètres suivants par leur valeur pour chaque facture</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%série</span> - Série de la facture</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%num</span> - Numéro de facture</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%id</span> - identifieur interne de la facture</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%datefac[</span><span style=" font-weight:600; font-style:italic;">dd.MM.yyyy</span><span style=" font-weight:600;">]</span> - date de facture en format quelconque accepté par postgresql</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%daterec[</span><span style=" font-weight:600; font-style:italic;">dd.MM.yyyy</span><span style=" font-weight:600;">]</span> - date de cout reçu dans un certain format admis par postgresql (il peut coïncider ou non avec la date de la facture, selon qu'il indique la Date de cout)</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%desc</span> - Texte de description de la facture</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%ref</span> - référence de la facture.</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%base</span> - base imposable</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%imp</span> - impots</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%total</span> - total avec impots inclus</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%coment</span> - comentaire de la facture</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">%contact</span> - personne de contact</p> <p style="-qt-paragraph-type:empty; margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"></p></body></html>

source: Aceptar
ca_es: Accepta
fr_fr: Accepter

source: Anos
ca_es: Anys
fr_fr: Années

source: Archivo
fr_fr: Fichiers

source: Banco
fr_fr: Banque

source: Banco de Cliente '%1' (para mi '%2') invalido en el recibo con id %3 (ref. %4), para cliente %5 (%6)
fr_fr: Banque du Client '%1' (pour mon '%2') invalide le reçu avec id %3 (ref. %4), du client %5 (%6)

source: Cancelar
ca_es: Cancel·la
fr_fr: Annuler

source: Concepto
ca_es: Concepte
fr_fr: Raison

source: Datos de recibos incorrectos
ca_es: Les dades dels rebuts són incorrectes.
fr_fr: Données du reçu incorrectes

source: Datos incorrectos
ca_es: Dades incorrectes
fr_fr: &Données incorrectes

source: Dias
ca_es: Dies
fr_fr: Jours

source: El CIF del ordenante
ca_es: El CIF de l'ordenant
fr_fr: C.I.F. de l'ordenant

source: El CIF del presentador (propiedades de Empresa)
ca_es: El CIF del presentador (propietats de l'Empresa)
fr_fr: CIF du présentateur (propriétés d'Entreprise)

source: Error al crear el archivo
fr_fr: Erreur en création du fichier

source: Excluidos %3 de %2 recibos por falta de fecha de vencimiento y otros %1 por falta de banco
ca_es: Han quedat exclosos %3 de %2 rebuts per manca de data de venciment i uns altres %1 per manca de banc
fr_fr: Exclus %3 de %2 reçus par manque de date d'échéance et autres %1 par manque de banque

source: FRA %serie%num %desc
fr_fr: FRA %série%num %desc

source: Falta NIF de su empresa
ca_es: Manca el NIF de la vostra empresa
fr_fr: Il manque le NIF de votre entreprise

source: Falta el banco
ca_es: Manca el banc
fr_fr: Il manque la banque

source: Falta el nombre de su empresa
ca_es: Manca el nom de la vostra empresa
fr_fr: Il manque le nom de votre entreprise

source: Fecha de Cargo
ca_es: Data de càrrec
fr_fr: Date de chargement

source: Fecha de factura
ca_es: Data de la factura
fr_fr: Date de facture

source: Fichero de remesa bancaria (Cuaderno 19)
ca_es: Fitxer de remesa bancària (Quadern 19)
fr_fr: Fiche de remise bancaire (Cahier 19)

source: Fichero q19 a generar para el banco
ca_es: Fitxer q19 a generar pel banc
fr_fr: Fiche q19 à générer pour la banque

source: Fichero(s) generado(s)
ca_es: Fitxer(s) generat(s)
fr_fr: Fiche générée

source: Generacion Q19
ca_es: Generació de Q19
fr_fr: Générer Q19

source: Meses
ca_es: Mesos
fr_fr: Mois

source: No hay facturas seleccionadas. Puede utilizar la columna selector para seleccionar los recibos a incluir en la remesa bancaria.
ca_es: No hi ha factures seleccionades. Pot utilitzar la columna selector per tal de seleccionar els rebuts a incloure en la remesa bancària
fr_fr: Il n'y a pas de factures sélectionnées. On peut utiliser la colonne sélecteur pour choisir les reçus à inclure dans la remise bancaire.

source: No hay recibos seleccionados. Puede utilizar la columna selector para seleccionar los recibos a incluir en la remesa bancaria.
ca_es: No hi ha rebuts seleccionats. Pot utilitzar la columna selector per a seleccionar els rebuts a incloure en la remesa bancària
fr_fr: Il n'y a pas de reçus sélectionnés On peut utiliser la colonne sélecteur pour choisir les reçus à inclure dans la remise bancaire.

source: No podemos generar remesas bancarias hasta que entre el NIF de su empresa en Propiedades de Empresa
ca_es: No podem generar remeses bancàries fins que poseu el NIF de la vostra empresa a Propietats de l'Empresa
fr_fr: Nous ne pouvons pas produire les remises bancaires tant que le NIF de votre entreprise n'est pas entré dans les Propriétés de l'entreprise

source: Por favor, escoja un banco donde cobrar los recibos a generar.
ca_es: Si us plau, trieu un banc on voleu cobrar els rebuts a generar.
fr_fr: S'il vous plaît, choisissez une banque pour percevoir les reçus générés.

source: Remesa mal generada
fr_fr: Propriétés générales

source: Remesa parcialmente generada
ca_es: Remesa generada parcialment
fr_fr: Remise partiellement générée

source: Remesa vacia
ca_es: Remesa buida
fr_fr: Remise vide

source: Semanas
ca_es: Setmanes
fr_fr: Hebdomadaire

source: Su entidad bancaria
ca_es: La vostra entitat bancària
fr_fr: Votre banque

source: Su oficina bancaria
ca_es: La vostra oficina bancària
fr_fr: Votre guichet de banque

source: Tiene los siguientes ficheros de recibos para los bancos: %1
ca_es: Teniu els següents fitxers de rebuts per als bancs: %1
fr_fr: Voici les fichiers de reçus suivants pour les banques : %1

source: Importe excesivo (%1) !. El limite son %2 digitos, incluyendo los 2 decimales
ca_es: Import excesiu (%1) !. El limit son %2 digits, incluint els 2

source: Importe negativo (%1) !
ca_es: Import negatiu (%1) !
