Repository: eboladev/Bulmages-1
Catalog: bulmages/bulmafact/plugins/pluginbf_clientefacturaivainc/po/pluginbf_clientefacturaivainc_*.po
Languages: ca_es

source: % Descuento
ca_es: % Descompte

source: % Recargo E.Q.
ca_es: % Recàrrec E.Q.

source: &Cancelar
ca_es: &Cancel·lar

source: &Detalle
ca_es: &Detalls

source: &Si
ca_es: &Sí

source: &Ventas
ca_es: &Vendes

source: Actualizar listado
ca_es: Actual·litza llistat

source: Almacen
ca_es: Magatzem

source: Almacen:
ca_es: Magatzem:

source: Borrar factura
ca_es: Esborra albarà

source: Borrar facturaivainc
ca_es: Esborrar facturaivainc

source: Buscar:
ca_es: Cerca:

source: Cantidad
ca_es: Quantitat

source: Cliente
ca_es: Client

source: Cliente:
ca_es: Client:

source: Codigo completo articulo
ca_es: Codi complet article

source: Codigo de almacen
ca_es: Codi de magatzem

source: Comentario
ca_es: Comentari

source: Comentario privado
ca_es: Comentari privat

source: Comentario&s
ca_es: Comentari&s

source: Comentarios del factura
ca_es: Comentaris de l'albarà

source: Comentarios privados:
ca_es: Comentaris privats:

source: Comentarios publicos:
ca_es: Comentaris publics:

source: Concepto descuento
ca_es: Concepte desconte

source: Configurar listado
ca_es: Configura llistat

source: Debe seleccionar una linea
ca_es: Cal triar una linea

source: Descripcion
ca_es: Descripció

source: Descripcion de forma de pago
ca_es: Descripció de la forma de pagament

source: Descripcion:
ca_es: Descripció

source: Descuentos:
ca_es: Descontes:

source: Editar factura
ca_es: Editar albarà

source: Error al borrar el factura a cliente
ca_es: Error al esborrar l'albarà a client

source: Error al crear el factura a cliente
ca_es: Error al crear l'albarà a client

source: Error inesperado
ca_es: Error inesperat

source: Existe un factura a este cliente con la misma referencia que este pedido. Desea abrirlo para verificar?
ca_es: Existeix un albarà a aquest client amb la mateixa referència que aquesta comanda.Desitja obrir-lo per a verificar?

source: Existe una factura a este cliente con la misma referencia que este pedido. Desea abrirlo para verificar?
ca_es: Hi ha un albarà a aquest client amb la mateixa referència que aquesta comanda. Desitgeu obrir-lo per verificar?

source: Factura ya existe
ca_es: Factura ja existeix

source: Fecha de factura
ca_es: Data de l'albarà

source: Fecha de creacion
ca_es: Data de creació:

source: Fecha de creacion:
ca_es: Data de creació:

source: Fecha final:
ca_es: Data final:

source: Fecha inicial:
ca_es: Data inicial:

source: Forma de pago
ca_es: Forma de pagament

source: Forma de pago:
ca_es: Forma de pagament:

source: Guardar factura
ca_es: Desa albarà

source: ID factura
ca_es: ID albarà

source: ID almacen
ca_es: ID Magatzem

source: ID cliente
ca_es: ID client

source: ID forma de pago
ca_es: ID Forma de pagament

source: ID trabajador
ca_es: ID treballador

source: Id factura
ca_es: ID albarà

source: Id articulo
ca_es: ID Article

source: Id descuento
ca_es: Id descompte

source: Imprimir listado
ca_es: Imprimeix el llistat

source: Imprimir facturaivainc
ca_es: Imprimeix facturaivainc

source: Impuestos
ca_es: Impostos

source: Mostrar/ocultar cabecera
ca_es: Mostrar/ocultar capçalera

source: Nombre articulo
ca_es: Nom d'article:

source: Nombre de cliente
ca_es: Nom del client

source: Nuevo factura
ca_es: Esborra albarà

source: Nuevo facturaivainc a cliente
ca_es: Nou facturaivainc a client

source: Orden
ca_es: Ordre

source: Referencia
ca_es: Referència

source: Referencia de factura
ca_es: Referència d'albarà

source: Referencia:
ca_es: Referència:

source: Total Linea
ca_es: Total Línia

source: Total:
ca_es: Totals:

source: Trabajador
ca_es: Treballador

source: Trabajador:
ca_es: Treballador:
