Repository: eboladev/Bulmages-1
Catalog: bulmages/bulmafact/plugins/pluginbf_mayor/po/pluginbf_mayor_*.po
Languages: fr_fr

source: &Cancelar
fr_fr: &Annuler

source: &Imprimir
fr_fr: &Imprimer

source: &Incluir asientos abiertos
fr_fr: &Inclure les écritures ouvertes

source: &Libro Mayor
fr_fr: &Grand livre

source: &Texto Plano
fr_fr: &Texte plat

source: &Ver
fr_fr: &Afficher

source: Actualizar
fr_fr: Actualiser

source: Ap&untes punteados
fr_fr: Ecrit&ures pointées

source: Apuntes &no punteados
fr_fr: Rubriques &non pointées

source: Apuntes con contrapartida:
fr_fr: Rubriques en contrepartie :

source: Apuntes con saldo inferior a:
fr_fr: Rubriques avec solde inférieur à :

source: Apuntes con saldo superior a:
fr_fr: Rubriques avec solde supérieur à :

source: Asiento
fr_fr: Ecriture

source: Borrar punteo
fr_fr: Effacer le pointage

source: Cargando Extracto de Cuentas
fr_fr: Charger les extraits de comptes

source: Cargar punteo
fr_fr: Charger le pointage

source: Casacion
fr_fr: Annulation

source: Centro Coste
fr_fr: Centre de finance

source: Comentario
fr_fr: Commentaire

source: Concepto
fr_fr: Concept

source: Configurar
fr_fr: Configurer

source: Cuenta
fr_fr: Compte

source: Cuenta Contrapartida:
fr_fr: Compte de contrepartie :

source: Cuenta Final:
fr_fr: Compte finale :

source: Cuenta Inicial:
fr_fr: Compte initial :

source: Cuenta final:
fr_fr: Compte finale :

source: Cuenta inicial:
fr_fr: Compte initial :

source: Cuenta:
fr_fr: Compte :

source: Debe
fr_fr: Débit

source: Debe final:
fr_fr: Débit final :

source: Debe inicial:
fr_fr: Débit initial :

source: Debe parcial:
fr_fr: Débit partiel :

source: Descripcion
fr_fr: Description

source: Descripcion Apunte
fr_fr: Libellé

source: Descripcion Asiento
fr_fr: Description de l'écriture

source: Extracto de Cuentas
fr_fr: Extraits de comptes

source: Fecha
fr_fr: Date

source: Fecha final:
fr_fr: Date finale :

source: Fecha inicial:
fr_fr: Date initiale :

source: Formato:
fr_fr: Format :

source: Generando Extracto
fr_fr: Générer des extraits

source: Guardar punteo
fr_fr: Sauvegarder le pointage

source: Haber
fr_fr: Crédit

source: Haber final:
fr_fr: Crédit final :

source: Haber inicial:
fr_fr: Débit initial :

source: Haber parcial:
fr_fr: Débit partiel :

source: Id contrapartida
fr_fr: Id Contrepartie

source: Impresion del Extracto
fr_fr: Impression de l'extrait

source: Imprimir
fr_fr: Imprimer

source: Mostrar asiento
fr_fr: Afficher l'écriture

source: Mostrar diario (ano)
fr_fr: Afficher le journal (an)

source: Mostrar diario (dia)
fr_fr: Afficher le journal (jour)

source: Mostrar diario (mes)
fr_fr: Afficher le journal (mois)

source: Mostrar/Oculatar filtro
fr_fr: Montrer/Occulter le filtre

source: Nombre de la cuenta:
fr_fr: Nom du Compte :

source: Ocultar aperturas y cierres
fr_fr: Occulter les ouvertures et les fermetures

source: Orden
fr_fr: Ordre

source: Permite ver el mayor
fr_fr: Afficher le grand livre

source: Podra disponer de la informacion del mayor
fr_fr: Disponibilité de l'information du grand livre

source: Propietario
fr_fr: Propriétaire

source: Punteo
fr_fr: Pointage

source: Punteo (*.pto);;Todos los archivos (*)
fr_fr: Pointage (*.pto);; De tous les fichiers (*)

source: Punteo:
fr_fr: Pointage :

source: Punteos (*.pto)
fr_fr: Pointage (*.pto)

source: Saldo
fr_fr: Solde

source: Saldo final:
fr_fr: Solde finale :

source: Saldo inicial:
fr_fr: Solde inicial :

source: Saldo parcial:
fr_fr: Solde partiel :

source: Se dispone a borrar el punteo. Este cambio es irrecuperable si no ha guardado su punteo. Desea continuar?
fr_fr: Vous vous préparez à effacer le pointage. Ce changement est irréversible si le pointage n'a pas été sauvegardé. Désirez vous continuer ?

source: Se ha producido un error
fr_fr: Une erreur s'est produite

source: Totales:
fr_fr: Totaux :

source: codigoborrador
fr_fr: Code du brouillon

source: contrapartida
fr_fr: Contrepartie

source: idapunte
fr_fr: idrubrique

source: idasiento
fr_fr: idécriture

source: idc_coste
fr_fr: idc_finance

source: idcuenta
fr_fr: idcompte

source: iddiario
fr_fr: idjournal

source: idtipoiva
fr_fr: idtypetva

source: marcaconciliacion
fr_fr: Marque de réconciliation

source: tipocuenta
fr_fr: type de compte
